{"meta":{"title":"Gopi Notes","subtitle":"Notes on .NET & Sitecore","description":null,"author":"Gopikrishna Gujjula","url":"http://gopigujjula.com"},"pages":[{"title":"Tags","date":"2016-01-02T12:46:45.548Z","updated":"2016-01-02T12:46:45.548Z","comments":true,"path":"tags/index.html","permalink":"http://gopigujjula.com/tags/index.html","excerpt":"","text":""},{"title":"About Me","date":"2016-10-30T08:06:26.625Z","updated":"2016-10-30T08:06:26.625Z","comments":true,"path":"projects/index.html","permalink":"http://gopigujjula.com/projects/index.html","excerpt":"","text":"I am Gopikrishna Gujjula, working as a Senior Engineer for an organization called Verndale, and residing in Bangalore, India.I have around 6+ years of experience in Software Development mainly using .NET technologies. I have experience in working on ASP.NET, MVC, C#, Spring.NET, NHibernate, Entity Framework, log4net, Sitecore, and ITextsharp.I have Maters degree (MCA) from Bangalore University."},{"title":"Categories","date":"2016-01-02T12:46:45.524Z","updated":"2016-01-02T12:46:45.524Z","comments":true,"path":"categories/index.html","permalink":"http://gopigujjula.com/categories/index.html","excerpt":"","text":""},{"title":"About Me","date":"2017-07-30T07:30:53.084Z","updated":"2017-07-30T07:30:53.084Z","comments":true,"path":"about/index.html","permalink":"http://gopigujjula.com/about/index.html","excerpt":"","text":"I am Gopikrishna Gujjula, currently working as a Senior Engineer (Sitecore Certified Developer) at Verndale, and residing in Bangalore, India. Technologies: .NET, C#, Sitecore, ASP.NET web forms, MVC, Spring.NET, NHibernate, Entity Framework, HTML, Java Script, and JQuery etc. Work Experience: Started Career way back in July-2010 as an Associate Engineer, totally having around 7 years in web development using .NET technologies. Speaking Engagements (Latest on Top) Sitecore User Group Bangalore - Sitecore Goals – Why, What &amp; How (May 2017) Sitecore User Group Bangalore - Dependency Injection In Sitecore (April 2017) Sitecore User Group Bangalore - Sitecore - Media Framework with Brightcove - Part 2 (March 2017) Sitecore User Group Hyderabad - Sitecore : Brightcove Video Cloud Connector (March 2017) Sitecore User Group Bangalore - Sitecore - Media Framework with Brightcove - Part 1 (March 2017) .NET User Group Bangalore - Sitecore : Web Content Management with .NET (February 2017) Sitecore User Group Bangalore - Sitecore : Enhancing Content Author Experience (January 2017) Certifications: Sitecore® XP 8 Website Development for .NET Developers Certification Rewards &amp; Recognition: Quarterly VET (Verndale Elite Team) award, for my contributions in maintaining &amp; enhancing some of the legacy Sitecore implementations at Verndale. Monthly reward, for my contributions in project at Verndale. Spot Award, for my contributions on some of the implementations in NTTData. Limited edition Poker Chip for my contributions in being a point of contact, and driving smoother production server setup and deployment, at Verndale. Internship: As part of my final semester project (MCA), did Internship for around five months from Feb-2010 to June-2010, in Symphony Services Bangalore. There I was part of a development team, and implemented some of the functionalities using ASP.NET web forms, C# and SQL server. Education: Completed Master of Computer Applications (MCA) from Bangalore University in 2010. Hobbies: Reading books, playing Table Tennis, and watching movies. Sitecore ProjectsDevelopment: PokerCentral Redken RedkenSalon Maintenance &amp; Enhancements: KVH Tepper School of Business Arbella Thales Grant Thornton Honeywell Aerospace Citi Center .NET Projects Babelsys securities processing system Many more intranet application"}],"posts":[{"title":"Sitecore - Missing Experience Profile Section ","slug":"sitecore-experience-profile-section-missing","date":"2017-07-30T06:13:00.000Z","updated":"2017-07-30T07:48:23.971Z","comments":true,"path":"2017/07/sitecore-experience-profile-section-missing/","link":"","permalink":"http://gopigujjula.com/2017/07/sitecore-experience-profile-section-missing/","excerpt":"","text":"Have you ever come across a scenario, where you installed Sitecore, and load the Sitecore dashboard, but only to find out whole Experience profile dashboard is missing. You might be wondering, may be installation gone wrong, or any configuration is missing. Couple of months back, I had faced this issue, only later to figure out that, actual issue is my Sitecore license supports CMS only mode, not the XP (Experience Platform). If you are facing the similar issue, always first check your Sitecore license. If you do not have a valid xDB license, CMS-only mode is enabled by default. References: The CMS-only mode configuration Happy Learning :)","categories":[{"name":"Sitecore","slug":"Sitecore","permalink":"http://gopigujjula.com/categories/Sitecore/"},{"name":"Troubleshooting","slug":"Sitecore/Troubleshooting","permalink":"http://gopigujjula.com/categories/Sitecore/Troubleshooting/"}],"tags":[{"name":"Sitecore","slug":"Sitecore","permalink":"http://gopigujjula.com/tags/Sitecore/"},{"name":"Beginner","slug":"Beginner","permalink":"http://gopigujjula.com/tags/Beginner/"}]},{"title":"Sitecore : Helix Project Learnings","slug":"sitecore-helix-project-learnings","date":"2017-07-23T05:30:00.000Z","updated":"2017-07-23T14:41:05.263Z","comments":true,"path":"2017/07/sitecore-helix-project-learnings/","link":"","permalink":"http://gopigujjula.com/2017/07/sitecore-helix-project-learnings/","excerpt":"","text":"I am currently working on a project which is based on the Helix principles, it has been couple of months, since I started working on this, here are some of my learnings, we use TDS (Team Development for Sitecore), 1.TDS Sync: one Sitecore item to one TDS projectNever sync same Sitecore item into multiple TDS projects, this creates lot of dependencies, as well as your automated package deployments go for a toss. 2. Web.config: Build Action to noneOther than your main web.config file, make sure to set all feature/foundation level web.config files Build Action to none, and Copy to Output Directory to Do not copy. If not, these files override the main web.config file.","categories":[{"name":"Sitecore","slug":"Sitecore","permalink":"http://gopigujjula.com/categories/Sitecore/"},{"name":"Helix Learning","slug":"Sitecore/Helix-Learning","permalink":"http://gopigujjula.com/categories/Sitecore/Helix-Learning/"}],"tags":[{"name":"Sitecore","slug":"Sitecore","permalink":"http://gopigujjula.com/tags/Sitecore/"},{"name":"Beginner","slug":"Beginner","permalink":"http://gopigujjula.com/tags/Beginner/"},{"name":"Helix","slug":"Helix","permalink":"http://gopigujjula.com/tags/Helix/"},{"name":"Habitat","slug":"Habitat","permalink":"http://gopigujjula.com/tags/Habitat/"},{"name":"TDS","slug":"TDS","permalink":"http://gopigujjula.com/tags/TDS/"}]},{"title":"Saturday Sitecore Learning - Layout","slug":"Saturday-Sitecore-Learning-Layout","date":"2017-07-08T15:38:00.000Z","updated":"2017-07-09T11:00:24.738Z","comments":true,"path":"2017/07/Saturday-Sitecore-Learning-Layout/","link":"","permalink":"http://gopigujjula.com/2017/07/Saturday-Sitecore-Learning-Layout/","excerpt":"","text":"LayoutIn previous posts, we learned all about templates, how to create a field, inheriting from another template, and setting default values using Standard values. Once we have a template created, we need to output the field content on pages/modules. This is where Layout comes into picture, layout is all about the presentation information, and also using which we make the connection between Sitecore and .NET code. One of the beauty of Sitecore is, as a developer, we have full control on the page HTML. Let’s have a brief look at page execution, Whenever a user browses for a page, Sitecore locates the particular content item, executes it’s layout, and all the required components, gets the html, and send it back to client to render it on the browser. In Sitecore tree, all Layout related items reside under Layout node. From presentation perspective, every page item, contains two things, 1. Layout Each page item has a single layout, which contains the information about basic page structure, and which would be common among all the pages, like html, head and body tags. In ASP.NET web-forms the layout file would be of .aspx extension, where as in ASP.NET MVC, this file would be of .cshtml extension. In Sitecore tree, all Layout related items reside under Layouts node. 2. Components/Modules In Sitecore, pages contain lot of components, like carousal module, or a generic callout, or any banner module. All these components would be independent from the page, so that they can be placed on any page. In Sitecore these are also called as Sub-layouts(web-forms) or Renderings(MVC). One page can have any number of components, and a same component can be added to multiple pages. In ASP.NET web-forms the component would be of .ascx extension, where as in ASP.NET MVC, this would be of .cshtml extension (or a Controller’s action method). All Sub-layouts items reside under Sublayouts node. All rendering items reside under Renderings node. In coming posts, let’s explore each one more deeply. Happy Learning :)","categories":[{"name":"Sitecore","slug":"Sitecore","permalink":"http://gopigujjula.com/categories/Sitecore/"},{"name":"Saturday Sitecore Learning","slug":"Sitecore/Saturday-Sitecore-Learning","permalink":"http://gopigujjula.com/categories/Sitecore/Saturday-Sitecore-Learning/"},{"name":"Layout","slug":"Sitecore/Saturday-Sitecore-Learning/Layout","permalink":"http://gopigujjula.com/categories/Sitecore/Saturday-Sitecore-Learning/Layout/"}],"tags":[{"name":"Sitecore","slug":"Sitecore","permalink":"http://gopigujjula.com/tags/Sitecore/"},{"name":"Beginner","slug":"Beginner","permalink":"http://gopigujjula.com/tags/Beginner/"},{"name":"Saturday Sitecore Learning","slug":"Saturday-Sitecore-Learning","permalink":"http://gopigujjula.com/tags/Saturday-Sitecore-Learning/"}]},{"title":"Saturday Sitecore Learning - Templates Part 7 (Template Types)","slug":"Saturday-Sitecore-Learning-Template-Part-7","date":"2017-06-24T15:38:00.000Z","updated":"2017-07-01T07:06:32.011Z","comments":true,"path":"2017/06/Saturday-Sitecore-Learning-Template-Part-7/","link":"","permalink":"http://gopigujjula.com/2017/06/Saturday-Sitecore-Learning-Template-Part-7/","excerpt":"","text":"Template TypesThis is the seventh post as part of Sitecore Template series. In previous posts, we learned about template fields, field types, importance of template inheritance, and Standard Values. In this post, let’s explore Template Types. Templates can be categorized into following ways. Page/Module Templates Folder Templates Branch Templates Parameter Templates Command Templates 1. Page/Module Templates These are the templates we use for page items, as well as for modules. When we use the template for pages, they also contain layout information. When we use them for module templates, they mainly used as data sources, and they do not contain any layout information. 2. Folder Templates Folder templates are used in a way to organize the content items. They neither contain fields (except Sitecore default fields) nor presentation details.The default folder template is present at /sitecore/templates/Common/Folder. Sitecore uses folder templates, in lot of places, like Templates Folder - To organize templates. Layout Folder - To organize layouts. Rendering Folder - To organize renderings. Media Folder - To organize media items. We can also create a custom folder template to organize our items, by inhering from the default folder template - /sitecore/templates/Common/Folder. 3. Branch Templates These are another variation of templates. At once we usually create an item from a template, but what if at a time, we need to create a group of items, Brnach template is the one to help. They reside under /sitecore/templates/Branches 4. Parameter Templates All the content fields are present on Page/Module templates. In some cases, we would need fields for configurations, like Search result count, background color etc, it is very tempting to create these fields also on the page/module templates. But as a best practice, we should always separate the content which will be displayed, and details of how to display the content. We can use parameter templates to manage the details about how to display the content. We can create a parameter template by deriving from /sitecore/templates/System/Layout/Rendering Parameters/Standard Rendering Parameters 5. Command Templates All other template categories contains a predefined structure. But what if we need to write some dynamic logic to create items, for this we use Command templates. Command template define a class and method to be called during an insert operation. Whenever we try to create an item from this template, associate class method would be executed. We can create a command template, using /System/Branches/Command Template Happy Learning :)","categories":[{"name":"Sitecore","slug":"Sitecore","permalink":"http://gopigujjula.com/categories/Sitecore/"},{"name":"Saturday Sitecore Learning","slug":"Sitecore/Saturday-Sitecore-Learning","permalink":"http://gopigujjula.com/categories/Sitecore/Saturday-Sitecore-Learning/"},{"name":"Templates","slug":"Sitecore/Saturday-Sitecore-Learning/Templates","permalink":"http://gopigujjula.com/categories/Sitecore/Saturday-Sitecore-Learning/Templates/"}],"tags":[{"name":"Sitecore","slug":"Sitecore","permalink":"http://gopigujjula.com/tags/Sitecore/"},{"name":"Beginner","slug":"Beginner","permalink":"http://gopigujjula.com/tags/Beginner/"},{"name":"Saturday Sitecore Learning","slug":"Saturday-Sitecore-Learning","permalink":"http://gopigujjula.com/tags/Saturday-Sitecore-Learning/"}]},{"title":"Sitecore : Media Framework With Brightcove - Part 5 - Configuration","slug":"Sitecore-Media-Framework-With-Brightcove-Configuration","date":"2017-05-17T11:30:00.000Z","updated":"2017-05-17T10:38:23.419Z","comments":true,"path":"2017/05/Sitecore-Media-Framework-With-Brightcove-Configuration/","link":"","permalink":"http://gopigujjula.com/2017/05/Sitecore-Media-Framework-With-Brightcove-Configuration/","excerpt":"","text":"Sitecore Media Framework with Brightcove Series Installing Media Framework Module Installing Brightcove Connector Integrating Brightcove Account In Sitecore Embed Media Into Sitecore Website Configuration Part 5 - Configuration1. Customize Brightcove TemplatesWhen we install Brightcove connector, there are some of the main templates gets added, We can use brightcove templates, similar way as our custom templates, Inherit from other templates Add new fields Add presentation When Brightcove Sync operation runs, our newly added field values are not effected, as there are no corresponding fields in Brightcove to sync. Note: Do not modify the existing fields, as the sync operation may not work as expected. 2. TDS &amp; Code generationWe can add Brightcove templates to project, similar way as any other templates. As there are couple of custom field types present, need to modify code gen templates accordingly.Ex: Image Preview, Read-Only Text, etc. 3. Video Search IndexBrightcove connector includes “mediaframework_brightcove_index“ index in Sitecore.ContentSearch.MediaFramework.Brightcove.config file. This index crawls on master database, and it is used for searching Brightcove items in Sitecore client. 4. CM &amp; CD Configuration To perform automatic media synchronization, Brightcove connector uses MediaFramework_Import_Brightcove scheduling agent, which is present in Sitecore.MediaFramework.Services.Brightcove.config file. This is required only on CM. Configurations not required on CD Scheduling Agents Brightcove Search Index References: https://community.sitecore.net/technical_blogs/b/getting_to_know_sitecore/posts/introducing-sitecore-media-framework Happy Learning :)","categories":[{"name":"Sitecore","slug":"Sitecore","permalink":"http://gopigujjula.com/categories/Sitecore/"},{"name":"Media Framework with Brightcove","slug":"Sitecore/Media-Framework-with-Brightcove","permalink":"http://gopigujjula.com/categories/Sitecore/Media-Framework-with-Brightcove/"}],"tags":[{"name":"Sitecore","slug":"Sitecore","permalink":"http://gopigujjula.com/tags/Sitecore/"},{"name":"Beginner","slug":"Beginner","permalink":"http://gopigujjula.com/tags/Beginner/"},{"name":"Brightcove","slug":"Brightcove","permalink":"http://gopigujjula.com/tags/Brightcove/"},{"name":"Sitecore Media Framework","slug":"Sitecore-Media-Framework","permalink":"http://gopigujjula.com/tags/Sitecore-Media-Framework/"}]},{"title":"Sitecore : Media Framework With Brightcove - Part 4 - Embed Media Into Sitecore Website","slug":"Sitecore-Media-Framework-With-Brightcove-Embed-Media","date":"2017-05-15T11:30:00.000Z","updated":"2017-05-17T08:55:03.333Z","comments":true,"path":"2017/05/Sitecore-Media-Framework-With-Brightcove-Embed-Media/","link":"","permalink":"http://gopigujjula.com/2017/05/Sitecore-Media-Framework-With-Brightcove-Embed-Media/","excerpt":"","text":"Sitecore Media Framework with Brightcove Series Installing Media Framework Module Installing Brightcove Connector Integrating Brightcove Account In Sitecore Embed Media Into Sitecore Website Configuration Part 4 - Embed Media Into SitecoreAfter integrating Brightcove account, within Sitecore, now content authors can search and select the videos, similar to any other Sitecore item. Media framework module, provides multiple ways for integrating Videos onto website pages, RTE Module (Rendering) 1. RTE (Rich Text Editor)When we install Media framework module, there would be two new buttons are added into Rich Text Editor ribbon. Embed Media Embed Media Link Using both these new buttons, Content Authors, can embed videos into rich text. Using Embed Media ButtonStep 1: Click on Embed Media button in RTE ribbon, Step 2: Click on Next button to proceed, Step 3: Filter the items, by selecting brightcovevideo template, Step 4: Select a video from the results, and click on Next to proceed, Step 5: In Properties window, fill out the required Width, Height values, select a media player, and click on close. Step 6: Now you can observe that, selected video is embedded. Using Embed Media LinkStep 1: Click on Embed Media Link button in RTE ribbon, This functionality is pretty much similar to the Embed Media button, except here it provides an option, to play the video in pop-up window. In Properties window, fill out the Link Title, Width, Height values, select a media player, and click on close. Compared to Embed Media, here we get extra field, to specify the Link Title. Step 2: Now you can observe that, Media Link Demo is added on the page. 2. Module (Rendering)When we install Media Framework module, we can notice that, there are three new items added in Layouts, each one under rendering, sublayouts, and placeholder settings. By adding Embed Media module (rendering/sublayout) to the page presentation, we can place a video on the particular page. In this example, let’s have a look at, how can we add it from Experience Editor, Step:1 Open page template presentation, and add embedMedia placeholder settings item. Step 2: Open the page item in Experience Editor, &amp; add new module, by selecting Embed Media rendering, Step 3: Now once the module is added on to the page, we can search &amp; select the video, using the new custom experience editor buttons (Embed Media Element, Update Media Parameters). After clicking on button, functionality is pretty similar to the way we select the videos from Embed Media button in RTE Step 4: Finally when we browse the page, we can see that there is a new video added on to the page. References: https://community.sitecore.net/technical_blogs/b/getting_to_know_sitecore/posts/introducing-sitecore-media-framework Happy Learning :)","categories":[{"name":"Sitecore","slug":"Sitecore","permalink":"http://gopigujjula.com/categories/Sitecore/"},{"name":"Media Framework with Brightcove","slug":"Sitecore/Media-Framework-with-Brightcove","permalink":"http://gopigujjula.com/categories/Sitecore/Media-Framework-with-Brightcove/"}],"tags":[{"name":"Sitecore","slug":"Sitecore","permalink":"http://gopigujjula.com/tags/Sitecore/"},{"name":"Beginner","slug":"Beginner","permalink":"http://gopigujjula.com/tags/Beginner/"},{"name":"Brightcove","slug":"Brightcove","permalink":"http://gopigujjula.com/tags/Brightcove/"},{"name":"Sitecore Media Framework","slug":"Sitecore-Media-Framework","permalink":"http://gopigujjula.com/tags/Sitecore-Media-Framework/"}]},{"title":"Sitecore : Media Framework With Brightcove - Part 3 - Integrating Brightcove Account In Sitecore","slug":"Sitecore-Media-Framework-With-Brightcove-Integrating-Brightcove-Account-In-Sitecore","date":"2017-05-14T10:30:00.000Z","updated":"2017-05-17T12:04:11.706Z","comments":true,"path":"2017/05/Sitecore-Media-Framework-With-Brightcove-Integrating-Brightcove-Account-In-Sitecore/","link":"","permalink":"http://gopigujjula.com/2017/05/Sitecore-Media-Framework-With-Brightcove-Integrating-Brightcove-Account-In-Sitecore/","excerpt":"","text":"Sitecore Media Framework with Brightcove Series Installing Media Framework Module Installing Brightcove Connector Integrating Brightcove Account In Sitecore Embed Media Into Sitecore Website Configuration Part 3 - Brightcove AccountIn previous posts, we had looked into, how to install both Media framework module, as well as the Brightcove connector. In this post, let’s explore how to make a connection between Sitecore and Brightcove account. To make a connection between Sitecore and Brightcove, we need to have a enterprise account in Brightcove. We can also create a trail account, but trail account does not have privileges to make a connection from external system, so we must have an enterprise account. Step 1:Once we have a Brightcove account, we need to collect three values Publisher ID Client Id Client Secret Step 2:Login to brightcove account. Click on the account name on the top right corner and then click on home to get the publisher id, Step 3:Next we need to create an Application, to get the Client ID, and Client Secret values, Click on Admin on top right corner and then API Authentication. Click on New application. Fill out details and check all the necessary check boxes for the APIs. Click on Save. Step 4:Once we have three values, login to Sitecore client, and navigate to /sitecore/media library/Media Framework/Accounts item, right click insert new Brightcove Account. Step 5:Fill in the publisher Id, client Id, and client secret. Step 6:Next, navigate to the Media Framework menu in toolbar, and click on Import All button, Step 7:Once the import is completed, we can navigate to newly created Brightcove account, and have a look at the bucket list for the media items imported from Brightcove. Now Content Author can search and select the videos, similar like any other Sitecore item. Step 8:In brightcove website navigate to players tab and select the players that needs to be added to Sitecore, collect the player id.Login to Sitecore, and navigate to the newly brightcove account, select the Players item under the new account, right click, insert a brightcove video player, and fill out the ID field, with the collected player ID. References: https://community.sitecore.net/technical_blogs/b/getting_to_know_sitecore/posts/introducing-sitecore-media-framework Happy Learning :)","categories":[{"name":"Sitecore","slug":"Sitecore","permalink":"http://gopigujjula.com/categories/Sitecore/"},{"name":"Media Framework with Brightcove","slug":"Sitecore/Media-Framework-with-Brightcove","permalink":"http://gopigujjula.com/categories/Sitecore/Media-Framework-with-Brightcove/"}],"tags":[{"name":"Sitecore","slug":"Sitecore","permalink":"http://gopigujjula.com/tags/Sitecore/"},{"name":"Beginner","slug":"Beginner","permalink":"http://gopigujjula.com/tags/Beginner/"},{"name":"Brightcove","slug":"Brightcove","permalink":"http://gopigujjula.com/tags/Brightcove/"},{"name":"Sitecore Media Framework","slug":"Sitecore-Media-Framework","permalink":"http://gopigujjula.com/tags/Sitecore-Media-Framework/"}]},{"title":"Sitecore : Media Framework With Brightcove - Part 2 - Installing Brightcove Connector","slug":"Sitecore-Media-Framework-With-Brightcove-Installing-Brightcove-Connector","date":"2017-05-12T05:30:00.000Z","updated":"2017-05-17T08:53:39.658Z","comments":true,"path":"2017/05/Sitecore-Media-Framework-With-Brightcove-Installing-Brightcove-Connector/","link":"","permalink":"http://gopigujjula.com/2017/05/Sitecore-Media-Framework-With-Brightcove-Installing-Brightcove-Connector/","excerpt":"","text":"Sitecore Media Framework with Brightcove Series Installing Media Framework Module Installing Brightcove Connector Integrating Brightcove Account In Sitecore Embed Media Into Sitecore Website Configuration Part 2 - What is Brightcove?Brightcove is an enterprise level, complete video hosting &amp; publishing platform, which is similar to Youtube, but of enterprise level. Some of the key features are: Video CMS Analytics Monetization Sitecore &amp; Brightcove Partnership:Sitecore partnered with both Brightcove &amp; Ooyala video hosting platforms, to implement connectors on top of the media framework. Till Aug-2016, Sitecore maintained, and supported both these connectors, after that Sitecore released this products as open-source, and discontinued support and maintenance. Now it is up to Sitecore community members, or the hosting providers to keep the connectors up to date, and give support. Brightcove has taken ownership of this module, and providing full support and maintenance. Brightcove Connector InstallationJust keep in mind that, first we need to install the Media Framework module, then only we can go ahead with the connector installation, as the connector is built on top of the media framework module. Download the related connector package from here Install the module from Installation wizard. Login to Sitecore, and select the Development Tools -&gt; Installation Wizard from startup menu, Upload the Sitecore Media Framework Brightcove Edition package, click next to proceed, copy the post installation steps, Click on Install to proceed, After the successful installation, check Restart the Sitecore Client, and click on close. Configuration changes (Post Installation steps):Step 1: Navigate to webroot, App_Config\\Include directory, In my case, brightcovedemo.local.com\\Website\\App_Config\\Include Step 2: Rename config file “Sitecore.MediaFramework.Services.Brightcove.Extended.config.disabled“ to “Sitecore.MediaFramework.Services.Brightcove.Extended.config“. Step 3: Open file “Sitecore.MediaFramework.Services.Brightcove.Extended.config“, navigate to section “Brightcove.StorageService“ and change the “[PUT YOUR WEB SITE URL HERE]” value with your website URL e.g. http://your-website.com. Step 4: Verify “ContentDatabaseName“ and “PublishDatabaseName“ element values. Step 5: Save and close the file. By this, we have completed, both Media Framework module setup, as well as the Brightcove connector installation. In next post, let’s explore the Brightcove account, and how can we connect to the same from Sitecore. References: https://community.sitecore.net/technical_blogs/b/getting_to_know_sitecore/posts/introducing-sitecore-media-framework Happy Learning :)","categories":[{"name":"Sitecore","slug":"Sitecore","permalink":"http://gopigujjula.com/categories/Sitecore/"},{"name":"Media Framework with Brightcove","slug":"Sitecore/Media-Framework-with-Brightcove","permalink":"http://gopigujjula.com/categories/Sitecore/Media-Framework-with-Brightcove/"}],"tags":[{"name":"Sitecore","slug":"Sitecore","permalink":"http://gopigujjula.com/tags/Sitecore/"},{"name":"Beginner","slug":"Beginner","permalink":"http://gopigujjula.com/tags/Beginner/"},{"name":"Brightcove","slug":"Brightcove","permalink":"http://gopigujjula.com/tags/Brightcove/"},{"name":"Sitecore Media Framework","slug":"Sitecore-Media-Framework","permalink":"http://gopigujjula.com/tags/Sitecore-Media-Framework/"}]},{"title":"Sitecore : Media Framework With Brightcove - Part 1 - Installing Media Framework Module","slug":"Sitecore-Media-Framework-With-Brightcove-Installing-Media-Framework-Module","date":"2017-05-03T13:33:00.000Z","updated":"2017-05-17T08:54:11.097Z","comments":true,"path":"2017/05/Sitecore-Media-Framework-With-Brightcove-Installing-Media-Framework-Module/","link":"","permalink":"http://gopigujjula.com/2017/05/Sitecore-Media-Framework-With-Brightcove-Installing-Media-Framework-Module/","excerpt":"","text":"Sitecore Media Framework with Brightcove Series Installing Media Framework Module Installing Brightcove Connector Integrating Brightcove Account In Sitecore Embed Media Into Sitecore Website Configuration Part 1 - Sitecore Media FrameworkIn simplest terms, Sitecore Media Framework module, help developers to integrate the media services into website. Prior to Media Framework, some of the most commonly used approaches to map videos into website are, Using RTF Managing Video id (Ex: Youtube video id) Custom Video Rendering In all three cases, Content Author has to manually copy the video information (Ex: video link, or video id), from media hosting website. This process might be ok, if we have very few number of videos on the site. But this would be very much time consuming for Content Authors, if the website serves heavy media content. To solve this problem, Sitecore has introduced Media Framework module, using which Content Authors can easily manage (import, export, &amp; upload etc) the media content. In the above picture, we can observe that, by using the media framework module, and respective hosting (Brightcove, Ooyala, Vimeo, or Youtube) connector, videos become Sitecore native objects. Once video becomes Sitecore native object, it has all the Sitecore capabilities, like content management, analytics, and personalization. By using the media framework with respective hosting provider (Ex: Brightcove) connector, Content authors can perform lot of functionalities, Import media from hosting platform Export media to hosting platform Upload videos from Sitecore to hosting platform Update/Delete video meta data directly from Sitecore Search and select videos to insert on pages To integrate media, we need to install two modules into Sitecore, Sitecore Media Framework module, Hosting provider (Brightcove or Ooyala) connector. Sitecore Media framework module Installation Select and download the respective Media Framework module from Sitecore. For this demo, I have downloaded Media Framework 2.1 module (for Sitecore 8.1) Install the module from Installation wizard. Open the Sitecore Workbox &amp; Select the Analytics Workflow, Deploy &amp; publish the playback page events (Playback Changed, Playback Completed, Playback Error &amp; Playback Started) Reporting DB configurations Login to Sitecore, and select the Development Tools -&gt; Installation Wizard from startup menu, Upload and select the Media framework package, click next to proceed, Click on Install to proceed, After the successful installation, check Restart the Sitecore Client, and click on close. After the package installation, need to deploy &amp; publish the playback page events, Select the Workbox option from startup menu, Check the Analytics Workflow checkbox, Check all the Playback related events, and click on Deploy(selected) After the installation, we can observe new items under template, layout, and media library Templates: Layout: Media Library: At the end, publish Site to web database. Reporting DB configurationSitecore uses couple of new database tables for storing anaytics related data with respective to videos. We need to run a SQL script on reporting database. We can download the script here. This script creates following tables in reporting database, MediaFrameworkMedia Fact_MediaFrameworkEvents References: https://community.sitecore.net/technical_blogs/b/getting_to_know_sitecore/posts/introducing-sitecore-media-framework Happy Learning :)","categories":[{"name":"Sitecore","slug":"Sitecore","permalink":"http://gopigujjula.com/categories/Sitecore/"},{"name":"Media Framework with Brightcove","slug":"Sitecore/Media-Framework-with-Brightcove","permalink":"http://gopigujjula.com/categories/Sitecore/Media-Framework-with-Brightcove/"}],"tags":[{"name":"Sitecore","slug":"Sitecore","permalink":"http://gopigujjula.com/tags/Sitecore/"},{"name":"Beginner","slug":"Beginner","permalink":"http://gopigujjula.com/tags/Beginner/"},{"name":"Brightcove","slug":"Brightcove","permalink":"http://gopigujjula.com/tags/Brightcove/"},{"name":"Sitecore Media Framework","slug":"Sitecore-Media-Framework","permalink":"http://gopigujjula.com/tags/Sitecore-Media-Framework/"}]},{"title":"Dependency Injection In Sitecore","slug":"Dependency-Injection-In-Sitecore-Webinar","date":"2017-04-23T14:30:00.000Z","updated":"2017-07-26T08:56:45.158Z","comments":true,"path":"2017/04/Dependency-Injection-In-Sitecore-Webinar/","link":"","permalink":"http://gopigujjula.com/2017/04/Dependency-Injection-In-Sitecore-Webinar/","excerpt":"","text":"Dependency Injection In SitecorePresentation Deck: Recorded Video: More details about the session can be found here","categories":[{"name":"Sitecore","slug":"Sitecore","permalink":"http://gopigujjula.com/categories/Sitecore/"},{"name":"Tech Talks","slug":"Sitecore/Tech-Talks","permalink":"http://gopigujjula.com/categories/Sitecore/Tech-Talks/"}],"tags":[{"name":"Sitecore","slug":"Sitecore","permalink":"http://gopigujjula.com/tags/Sitecore/"},{"name":"Presentation","slug":"Presentation","permalink":"http://gopigujjula.com/tags/Presentation/"},{"name":"Sitecore User Group","slug":"Sitecore-User-Group","permalink":"http://gopigujjula.com/tags/Sitecore-User-Group/"},{"name":"SUG Bangalore","slug":"SUG-Bangalore","permalink":"http://gopigujjula.com/tags/SUG-Bangalore/"}]},{"title":"Search Tips: Computed Index Field return value","slug":"Sitecore-search-tips-computed-field-return-value","date":"2017-04-14T17:25:00.000Z","updated":"2017-04-27T07:28:34.014Z","comments":true,"path":"2017/04/Sitecore-search-tips-computed-field-return-value/","link":"","permalink":"http://gopigujjula.com/2017/04/Sitecore-search-tips-computed-field-return-value/","excerpt":"","text":"Computed field helps us in doing some extra processing before adding the value to index. While creating a computed index field, always try to return null, rather than String.Empty(unless it is important to have an empty value), because String.Empty takes space in the index, whereas when it is null, it is not added to the index. By returning null value, we can save the space in the index. Happy Learning :)","categories":[{"name":"Sitecore","slug":"Sitecore","permalink":"http://gopigujjula.com/categories/Sitecore/"},{"name":"Tech Tips","slug":"Sitecore/Tech-Tips","permalink":"http://gopigujjula.com/categories/Sitecore/Tech-Tips/"}],"tags":[{"name":"Sitecore","slug":"Sitecore","permalink":"http://gopigujjula.com/tags/Sitecore/"},{"name":"Search","slug":"Search","permalink":"http://gopigujjula.com/tags/Search/"},{"name":"Computed Index","slug":"Computed-Index","permalink":"http://gopigujjula.com/tags/Computed-Index/"}]},{"title":"Saturday Sitecore Learning - Templates Part 6 (Standard Values)","slug":"Saturday-Sitecore-Learning-Template-Part-6","date":"2017-04-08T04:54:00.000Z","updated":"2017-04-08T15:13:23.002Z","comments":true,"path":"2017/04/Saturday-Sitecore-Learning-Template-Part-6/","link":"","permalink":"http://gopigujjula.com/2017/04/Saturday-Sitecore-Learning-Template-Part-6/","excerpt":"","text":"Standard ValuesThis is the sixth post as part of Sitecore Template series. In previous posts, we learned about template fields, different field types and importance of template inheritance, in this post, let’s explore Standard Values. Standard Values are a way to provide default values to template fields. Once we create a Standard Values for a template, and set the default values for fields, any item which is created from this template gets the default values, later content author can also modify the values, on item level. Standard Values are also useful to have a complete picture of what are all the fields a template has, including the inherited fields. We can also set default presentation details, and insert options on Standard values. By looking at Standard Values, we can understand what all the fields a template contains, including the inherited fields. Let’s take the example of three templates, which are created based on previous post Add Standard Value Let’s explore how to add a Standard Value to Article Template, Step 1. Open the Content Editor, navigate to Templates &amp; select the Article Template. Step 2. Select the Builder Options menu from ribbon, and click on the Standard Values. (To view the Builder Options menu, on template level, we need to select the Builder tab) Step 3. Now we should be able to see __Standard Values item under the Article template. Step 4. If we look at newly created __Standard Values template, we can observe that there are Article template fields, as well as the inherited fields from Base Content template. Adding Default Values: We can add default value to a field, statically or dynamically (with tokens), for the simplicity now let’s add a static value. Step 1: Open the Article template Standard Values, and select a today’s date for Date field, and save it. Step 2: Create a new Article item under Home node. Step 3: In newly created Test Article, we can see the Date field value has today’s date, and all other fields are empty. Observe that there is a Standard Value text just beside the Date field name. Step 4: Let’s change the Date field value. Now observe that Standard Value text is disappeared, that means we have broken the Default value inheritance. In next post, let’s explore different template types. Happy Learning :)","categories":[{"name":"Sitecore","slug":"Sitecore","permalink":"http://gopigujjula.com/categories/Sitecore/"},{"name":"Saturday Sitecore Learning","slug":"Sitecore/Saturday-Sitecore-Learning","permalink":"http://gopigujjula.com/categories/Sitecore/Saturday-Sitecore-Learning/"},{"name":"Templates","slug":"Sitecore/Saturday-Sitecore-Learning/Templates","permalink":"http://gopigujjula.com/categories/Sitecore/Saturday-Sitecore-Learning/Templates/"}],"tags":[{"name":"Sitecore","slug":"Sitecore","permalink":"http://gopigujjula.com/tags/Sitecore/"},{"name":"Beginner","slug":"Beginner","permalink":"http://gopigujjula.com/tags/Beginner/"},{"name":"Saturday Sitecore Learning","slug":"Saturday-Sitecore-Learning","permalink":"http://gopigujjula.com/tags/Saturday-Sitecore-Learning/"}]},{"title":"Sitecore - Media Framework with Brightcove - Part 2 Webinar","slug":"Sitecore-MediaFramework-with-Brightcove-part-2-Webinar","date":"2017-03-19T12:30:00.000Z","updated":"2017-07-26T08:57:11.967Z","comments":true,"path":"2017/03/Sitecore-MediaFramework-with-Brightcove-part-2-Webinar/","link":"","permalink":"http://gopigujjula.com/2017/03/Sitecore-MediaFramework-with-Brightcove-part-2-Webinar/","excerpt":"","text":"Sitecore : Media Framework with Brightcove - Part 2 Presentation Deck: Recorded Video: More details about the session can be found here","categories":[{"name":"Sitecore","slug":"Sitecore","permalink":"http://gopigujjula.com/categories/Sitecore/"},{"name":"Tech Talks","slug":"Sitecore/Tech-Talks","permalink":"http://gopigujjula.com/categories/Sitecore/Tech-Talks/"}],"tags":[{"name":"Sitecore","slug":"Sitecore","permalink":"http://gopigujjula.com/tags/Sitecore/"},{"name":"Presentation","slug":"Presentation","permalink":"http://gopigujjula.com/tags/Presentation/"},{"name":"Sitecore User Group","slug":"Sitecore-User-Group","permalink":"http://gopigujjula.com/tags/Sitecore-User-Group/"},{"name":"SUG Bangalore","slug":"SUG-Bangalore","permalink":"http://gopigujjula.com/tags/SUG-Bangalore/"}]},{"title":"Sitecore : Brightcove Video Cloud Connector","slug":"Sitecore-Brightcove-Video-Cloud-Connector","date":"2017-03-13T12:30:00.000Z","updated":"2017-07-26T08:56:58.993Z","comments":true,"path":"2017/03/Sitecore-Brightcove-Video-Cloud-Connector/","link":"","permalink":"http://gopigujjula.com/2017/03/Sitecore-Brightcove-Video-Cloud-Connector/","excerpt":"","text":"Sitecore : Brightcove Video Cloud Connector Presentation Deck: Recorded Video:No Recorded video. More details about the session can be found here","categories":[{"name":"Sitecore","slug":"Sitecore","permalink":"http://gopigujjula.com/categories/Sitecore/"},{"name":"Tech Talks","slug":"Sitecore/Tech-Talks","permalink":"http://gopigujjula.com/categories/Sitecore/Tech-Talks/"}],"tags":[{"name":"Sitecore","slug":"Sitecore","permalink":"http://gopigujjula.com/tags/Sitecore/"},{"name":"Presentation","slug":"Presentation","permalink":"http://gopigujjula.com/tags/Presentation/"},{"name":"Sitecore User Group","slug":"Sitecore-User-Group","permalink":"http://gopigujjula.com/tags/Sitecore-User-Group/"},{"name":"SUG Hyderabad","slug":"SUG-Hyderabad","permalink":"http://gopigujjula.com/tags/SUG-Hyderabad/"}]},{"title":"Sitecore - Media Framework with Brightcove - Part 1 Webinar","slug":"Sitecore-MediaFramework-with-Brightcove-part-1-Webinar","date":"2017-03-05T14:30:00.000Z","updated":"2017-07-26T08:57:05.786Z","comments":true,"path":"2017/03/Sitecore-MediaFramework-with-Brightcove-part-1-Webinar/","link":"","permalink":"http://gopigujjula.com/2017/03/Sitecore-MediaFramework-with-Brightcove-part-1-Webinar/","excerpt":"","text":"Sitecore : Media Framework with Brightcove - Part 1 Presentation Deck: Recorded Video: More details about the session can be found here","categories":[{"name":"Sitecore","slug":"Sitecore","permalink":"http://gopigujjula.com/categories/Sitecore/"},{"name":"Tech Talks","slug":"Sitecore/Tech-Talks","permalink":"http://gopigujjula.com/categories/Sitecore/Tech-Talks/"}],"tags":[{"name":"Sitecore","slug":"Sitecore","permalink":"http://gopigujjula.com/tags/Sitecore/"},{"name":"Presentation","slug":"Presentation","permalink":"http://gopigujjula.com/tags/Presentation/"},{"name":"Sitecore User Group","slug":"Sitecore-User-Group","permalink":"http://gopigujjula.com/tags/Sitecore-User-Group/"},{"name":"SUG Bangalore","slug":"SUG-Bangalore","permalink":"http://gopigujjula.com/tags/SUG-Bangalore/"}]},{"title":"Sitecore Enhancing Content Author Experience - Part 3 (Content)","slug":"Sitecore-Enhancing-Content-Author-Experience-Part-3","date":"2017-02-26T11:54:00.000Z","updated":"2017-07-30T07:08:55.157Z","comments":true,"path":"2017/02/Sitecore-Enhancing-Content-Author-Experience-Part-3/","link":"","permalink":"http://gopigujjula.com/2017/02/Sitecore-Enhancing-Content-Author-Experience-Part-3/","excerpt":"","text":"Enhancing Content Author Experience - Content levelThis is the third and final post as part of Sitecore Enhancing Content Author Experience series. Template Layout Content In last two posts, we had explored from both template &amp; layout level, in this post, let’s explore at Content level. 1. Sitecore Web ControlsSitecore provides two editors for managing the content, i.e. Content Editor &amp; Experience Editor. Now a days almost all Content Authors are using Experience editor to manage their content. To support their activities in Experience Editor, as a developer we need to take care of few things. If we render any field content with normal HTML/.NET controls, Content authors will not have any provision to manage them using experience editor. That’s the reason, we always need to render fields content using Sitecore web controls, in this way content author can manage them from experience editor as well. Some of the examples: Single Line Text:123&lt;sc:Text runat=&quot;server&quot; ID=&quot;Title&quot; Field=&quot;Name&quot; /&gt;or@Html.Sitecore().Field(&quot;Name&quot;) Image:123&lt;sc:Image runat=&quot;server&quot; ID=&quot;ListingImage&quot; Field=&quot;Listing Image&quot; /&gt;or@Html.Sitecore().Field(&quot;Listing Image&quot;) General Link:123&lt;sc:Link runat=&quot;server&quot; ID=&quot;CTA&quot; Field=&quot;CTA&quot; /&gt;or@Html.Sitecore().Field(&quot;CTA&quot;) 2. Custom Experience Editor ButtonSitecore does not support in-line editing for Checkbox, Multilist, TreeList, and other fields. There are no specific Sitecore controls to support these field types. By utilizing Custom Experience Editor buttons, we can provide editing option in experience editor for these fields. In this post let’s explore, how do we achieve it with Field Editor button. Field Editor Button:We can find all experience editor buttons in core database, under /sitecore/Content/Applications/WebEdit item.Following are the steps, to configure a field editor button,Step 1: Switch to the Core database, navigate to /sitecore/Content/Applications/WebEdit/Custom Experience Buttons items in content editor.Step 2: Create a new button item, using /sitecore/templates/System/WebEdit/Field Editor Button template.Step 3: Fill out all four fields, Header, Icon, Fields, Tooltip. Fields is the important one here, as we need to add the field title name. (In our case Country is the field which is of Multilist field type) Step 4: Switch to master database, and navigate to the component (sub-layout/rendering), and map the newly created button using Experience Editor Buttons field. Step 5: Now go to experience editor, and edit the component, we can see new Edit button, using which we can edit Country Multilist field. We can use, Edit frames to achieve the same. In Summary, being a developer, sometimes we often overlook the importance of Content Authors experience to manage their content. It is very important to imagine ourselves as Content Author position, and think how difficult they feel while managing the content.Even after knowing all the topics, we tend to miss few of the things, because of the tight deadlines, or for some other reasons. But it is better to have a check list, and do a self-review on these points, before moving any component development to next environment. Thank you, and that’s all for now. Happy Learning :)","categories":[{"name":"Sitecore","slug":"Sitecore","permalink":"http://gopigujjula.com/categories/Sitecore/"},{"name":"Enhancing Content Author Experience","slug":"Sitecore/Enhancing-Content-Author-Experience","permalink":"http://gopigujjula.com/categories/Sitecore/Enhancing-Content-Author-Experience/"}],"tags":[{"name":"Sitecore","slug":"Sitecore","permalink":"http://gopigujjula.com/tags/Sitecore/"},{"name":"Beginner","slug":"Beginner","permalink":"http://gopigujjula.com/tags/Beginner/"},{"name":"Content Author Experience","slug":"Content-Author-Experience","permalink":"http://gopigujjula.com/tags/Content-Author-Experience/"}]},{"title":"Sitecore Enhancing Content Author Experience - Part 2 (Layouts)","slug":"Sitecore-Enhancing-Content-Author-Experience-Part-2","date":"2017-02-26T04:54:00.000Z","updated":"2017-07-30T07:12:26.510Z","comments":true,"path":"2017/02/Sitecore-Enhancing-Content-Author-Experience-Part-2/","link":"","permalink":"http://gopigujjula.com/2017/02/Sitecore-Enhancing-Content-Author-Experience-Part-2/","excerpt":"","text":"Enhancing Content Author Experience - Layouts levelThis is the second post as part of Sitecore Enhancing Content Author Experience series. Template Layout Content In previous post, we had explored how can we enhance content author experience from template perspective, in this post, let’s explore at layouts level. 1. Data source LocationIn Sitecore, each page is a collection of components. We can add any number of components to a page, and some of the components we add to the page, have their own associated content. Content authors can select the associated content using data source. If we are not restricting data source location, then full content tree is shown in the selectable items list, then content authors have a tough time to navigate and select the associated content. Giving proper Datasource location helps in this situation, we can set selectable items location, while creating sub-layout/rendering using Datasource Location field. without data source location (full content tree is listed as bel) with data source location (items shown, based on the location) Here you can read more information about data source location. 2. Data source TemplateOnce we specify data source location, still content author has to know, What’s the associated content item to choose. If there are only similar content items present in the location, then it becomes easier. But what if there are different variety of content items are present, then it is our job to guide them, to select proper items. We can achieve this by using Datasource template, which can be set on sub-layout/rendering Datasource Template field. Without Data source Template: Any content item can be selected. Create New Content option is grayed out, because, Sitecore does not know, using which template it has to create new item. (I remember in Sitecore certification exam, there was a question on when does Create New Content is grayed out) With Data source template: Sitecore prompts with a message, when other template item is selected. Create New Item option is available, using which Content authors can create new content directly from here. 3. Placeholder SettingsWe can empower the Experience Editor using placeholder settings (Allowed Controls). It is very important to set allowed controls for each placeholder, otherwise it would be difficult for content authors to know, What are all components can be placed on particular placeholder. Without allowed controls being set, content authors have to navigate from root and find exact component to add. Without Allowed controls being set With Allowed controls being set 4. ThumbnailAfter allowed controls is being set, now content authors can see the list of renderings in Select a Rendering window. But there is no visual clue, about what design they see on page, by selecting a particular component. Thumbnail is useful for this purpose. Thumbnail can be set at Rendering/sub-layout items. We have an option to take screen shot as well, or select an image from media library. Below, we can observe that “Article module” is having thumbnail view, but Product module is not having any thumbnail view. Thank you for reading, in next post, will explore the tips from content level. Happy Learning :)","categories":[{"name":"Sitecore","slug":"Sitecore","permalink":"http://gopigujjula.com/categories/Sitecore/"},{"name":"Enhancing Content Author Experience","slug":"Sitecore/Enhancing-Content-Author-Experience","permalink":"http://gopigujjula.com/categories/Sitecore/Enhancing-Content-Author-Experience/"}],"tags":[{"name":"Sitecore","slug":"Sitecore","permalink":"http://gopigujjula.com/tags/Sitecore/"},{"name":"Beginner","slug":"Beginner","permalink":"http://gopigujjula.com/tags/Beginner/"},{"name":"Content Author Experience","slug":"Content-Author-Experience","permalink":"http://gopigujjula.com/tags/Content-Author-Experience/"}]},{"title":"Sitecore Enhancing Content Author Experience - Part 1 (Templates)","slug":"Sitecore-Enhancing-Content-Author-Experience-Part-1","date":"2017-02-25T21:05:00.000Z","updated":"2017-07-30T07:10:52.052Z","comments":true,"path":"2017/02/Sitecore-Enhancing-Content-Author-Experience-Part-1/","link":"","permalink":"http://gopigujjula.com/2017/02/Sitecore-Enhancing-Content-Author-Experience-Part-1/","excerpt":"","text":"Enhancing Content Author Experience - Template levelThis is the first post as part of Sitecore Enhancing Content Author Experience series. As a Sitecore developer, I always feel we have two primary users of our work; One is a website visitor, and second one is Content authors. Most of the time, we tend to give more importance to our site visitor, as they make the business happen, but we need to give equal importance to Content authors, to improve their overall experience of managing content. In this three post series, let’s explore some of the tips to enhance content author experience,Lets divide this Enhancing Content author experience into three levels Template Layout Content As part of this post, let’s explore templates. 1. Template IconTemplate Icons help to visually separate semantically related content items. We can Visually provide clues to the type of item in the content tree, by choosing unique icon to each template. Image Courtesy: https://sitecorecreative.wordpress.com/2012/07/13/sitecore-icon-selector/ As a content author, how do you feel, when you see the left side and right side content trees in above screen shot. Definitely left side tree, is much more helpful, because by looking at icons, we can understand item type. Icons can be set at template level, or item level. Two ways we can set icons, one is by directly clicking on the template icon, another one is from configure tab. 2. Field TypeSelecting appropriate field type is key for managing the content, as field type effects, what control content author use to modify that field content. Sitecore provides various in-built field types, and if needed we can also create custom field types. Check out more about field types here. For example, let’s take the case of Multilist or Multilist with search field types. Both provides a list of items, to choose, but second field type provides extra search option too, this is very much useful, when there are too many selectable items, otherwise it is difficult to scroll and select. 3. Field SourceFor list field types, we can control the list of selectable items to be displayed, using field source property. Field source can be set using; Sitecore query, path, and GUID. When Treelist field type is used, and source is not set, full Sitecore tree is displayed in selectable items. Then it is very difficult for Content author, to navigate and select the appropriate item from root node. 4. Field Help MessageHelp message gives extra information to Content Authors about particular field. Sitecore provides the ability to add help information to fields in three ways – using short description, long description, and help link. These three fields are part of the standard fields.Short description is displayed beside the field title, Long description is visible on field title mouse hover, Help link can be navigated, by clicking on field title. 5. Field SortingFor each page, or component, there may be lot of content fields to manage. But among all the fields, there may be few fields which gets changed very frequently. But if these fields are at bottom of the field list, every time content author has to scroll, to make any updates. It is better to place most frequently modified fields on top, using Sort order field, which is part of the standard fields. By default, Sitecore will set sort order to 100 points. 6. Folder Templates - Insert OptionsFolder templates are used for the purpose of organizing a collection of items. (ex: Rendering folder, Template Folder). The insert options configuration provides that the templates relevant to the folder are immediately available.The default folder template for content items is /sitecore/templates/Common/Folder.To create a custom folder template, we need to inherit from the default folder template, and then configure with custom insert options. 7. Parameter TemplatesThere is a difference between What &amp; How to content. What content means is the actual content on site, whereas How to content means, which controls behavior of the content, example, Search page size, CSS class, number of carousel items.Most of the time, we tend to mix How to content fields with What content fields, but it is very important to don’t mix both, to make sure content looks neat and clean.On component level, we can manage “How to” content using key value pair section. But Content Authors may find difficult to remember, &amp; enter exact key names. To avoid this we can use parameter templates. Managing How to content becomes more easier using parameter templates. We can create parameter templates, like any other templates, but these templates should inherit from /sitecore/templates/System/Layout/Rendering Parameters/Standard Rendering Parameters Once parameter template is created, it can be added to component using Parameters Template on the rendering. Only one parameter template is allowed on one component, that is the reason inheritance is very important for the parameter templates. Once parameter template is added to component, Content can be modified from Control Properties which can be accessed using Page Item Presentation details. Thank you for reading, in next post, will explore the tips from layout level. Happy Learning :)","categories":[{"name":"Sitecore","slug":"Sitecore","permalink":"http://gopigujjula.com/categories/Sitecore/"},{"name":"Enhancing Content Author Experience","slug":"Sitecore/Enhancing-Content-Author-Experience","permalink":"http://gopigujjula.com/categories/Sitecore/Enhancing-Content-Author-Experience/"}],"tags":[{"name":"Sitecore","slug":"Sitecore","permalink":"http://gopigujjula.com/tags/Sitecore/"},{"name":"Beginner","slug":"Beginner","permalink":"http://gopigujjula.com/tags/Beginner/"},{"name":"Content Author Experience","slug":"Content-Author-Experience","permalink":"http://gopigujjula.com/tags/Content-Author-Experience/"}]},{"title":"Saturday Sitecore Learning - Templates Part 5 (Template Inheritance)","slug":"Saturday-Sitecore-Learning-Template-Part-5","date":"2017-02-25T05:47:00.000Z","updated":"2017-02-28T05:36:22.296Z","comments":true,"path":"2017/02/Saturday-Sitecore-Learning-Template-Part-5/","link":"","permalink":"http://gopigujjula.com/2017/02/Saturday-Sitecore-Learning-Template-Part-5/","excerpt":"","text":"Template InheritanceThis is the fifth post as part of Sitecore Template series. In last three posts, we discussed about field types, now let’s explore what is template Inheritance, and the benefits it provide. Template is a collection of fields, where fields can be defined on a template, or can be inherited from other templates. Similar to Object Oriented Programming, where a class can be inherited from another class, in Sitecore, a template can be inherited from another template. Each template can inherit fields, field sections, standard values, and potentially other properties from any number of other templates. Sitecore uses lot of template inheritance, for system templates. There is a Standard Template, which defines field sections, and fields common to all items. Whenever we create any new template, it will always inherit from the Standard Template, and all the System Fields comes with it. Why do we use Inheritance?In general, we use Inheritance, for reusability. Where we can define the properties, &amp; methods in one common place, and access it from all other places. for Maintainability, where it is easy to make modification at single location. Sitecore Template Inheritance Benefits Reusability: We define common fields in one template, and inherit in all other templates. This avoids duplication. Maintainability: Modify the fields in the main template, all the templates automatically gets the modifications. Scenario:Let’s look into a Scenario, where we have Article template, and Podcast template, both are having certain fields common, like Title, Date, and Description etc. What if we create a new base template, with all these common fields, and inherit it, in both Article and Podcast template. In this way we can remove the duplication, and increase the reusability. Important points If you directly or indirectly inherit from the same template more than once, Sitecore behaves as if you had inherited that template only once.For example, Template B inherits from Template A, Template C inherits from both Template A &amp; B, here indirectly we are inheriting Template A (once directly, and another indirectly from B), multiple times. But Sitecore inherits Template A only once. One template, can only inherit one set of presentation details. If a template inherits from two templates, and both have presentation details, only the first template’s presentation details in the inheritance list will be used. (In the coming post, we will explore more about presentation details) If two templates are having same field section name, then when a template inherits from these two templates, similar field sections are merged, and all the fields under them are consolidated. We should avoid Circular templates. for example, Template A can inherit from Templates B and C. Template C can inherit from Template A, too. References: http://gettingtoknowsitecore.blogspot.in/2010/01/inheritance-content-modeling-sitecore.html http://www.matthewdresser.com/sitecore/template-inheritance-best-practices Professional Sitecore Development Professional Sitecore 8 Development: A Complete Guide to Solutions and Best Practices Happy Learning :)","categories":[{"name":"Sitecore","slug":"Sitecore","permalink":"http://gopigujjula.com/categories/Sitecore/"},{"name":"Saturday Sitecore Learning","slug":"Sitecore/Saturday-Sitecore-Learning","permalink":"http://gopigujjula.com/categories/Sitecore/Saturday-Sitecore-Learning/"},{"name":"Templates","slug":"Sitecore/Saturday-Sitecore-Learning/Templates","permalink":"http://gopigujjula.com/categories/Sitecore/Saturday-Sitecore-Learning/Templates/"}],"tags":[{"name":"Sitecore","slug":"Sitecore","permalink":"http://gopigujjula.com/tags/Sitecore/"},{"name":"Beginner","slug":"Beginner","permalink":"http://gopigujjula.com/tags/Beginner/"},{"name":"Saturday Sitecore Learning","slug":"Saturday-Sitecore-Learning","permalink":"http://gopigujjula.com/tags/Saturday-Sitecore-Learning/"}]},{"title":"Sitecore Web Content Management System with .NET","slug":"Sitecore-Web-CMS-with-.NET","date":"2017-02-22T04:30:00.000Z","updated":"2017-07-26T08:57:18.925Z","comments":true,"path":"2017/02/Sitecore-Web-CMS-with-.NET/","link":"","permalink":"http://gopigujjula.com/2017/02/Sitecore-Web-CMS-with-.NET/","excerpt":"","text":"First presentation in .NET User Group BangaloreI am regular attendee to .NET User Group Bangalore. It was always my wish to present in the meetup. At last, recently I had given my first presentation in .NET User Group Bangalore, It was wonderful experience of preparing, practicing, and delivering it in front of audience. Presentation Deck: Recorded Video: More details about the talk can be found here Thanks to Surendra, Haribabu and Anand Gothe for their support and encouragement.","categories":[{"name":"Sitecore","slug":"Sitecore","permalink":"http://gopigujjula.com/categories/Sitecore/"},{"name":"Tech Talks","slug":"Sitecore/Tech-Talks","permalink":"http://gopigujjula.com/categories/Sitecore/Tech-Talks/"}],"tags":[{"name":"Sitecore","slug":"Sitecore","permalink":"http://gopigujjula.com/tags/Sitecore/"},{"name":"Beginner","slug":"Beginner","permalink":"http://gopigujjula.com/tags/Beginner/"},{"name":"Presentation","slug":"Presentation","permalink":"http://gopigujjula.com/tags/Presentation/"},{"name":".NET User Group","slug":"NET-User-Group","permalink":"http://gopigujjula.com/tags/NET-User-Group/"}]},{"title":"Sitecore - Frequently Asked Questions","slug":"Sitecore-FAQ","date":"2017-02-12T07:30:00.000Z","updated":"2017-02-26T11:06:06.770Z","comments":true,"path":"2017/02/Sitecore-FAQ/","link":"","permalink":"http://gopigujjula.com/2017/02/Sitecore-FAQ/","excerpt":"","text":"Exactly one and half year back When I started learning Sitecore as a .Net developer few questions were in my mind. Now I feel like I’m able to answer all those by adding some more questions asked by participants in last week presentation in Dotnet Bangalore user group. 1. What is CMS/WCMS?If we break CMS (Content Management System) into pieces, Content: Content is a resource; it can be document, pdf, image, audio, or video file etc.Management: Organizing (add/update/delete) the content.System: Application/Platform which helps to manage the content. Let’s combine 3 pieces for definition,Content Management System (CMS): CMS is a system which helps to manage the content.Web Content Management System (CMS): WCMS is a system which helps to manage the content, via web interface. 2. What problem Content Management systems are trying to solve?In very high level note, we can categorize websites into Static &amp; Dynamic sites,In Static Sites content is not changed so frequently, but whereas in Dynamic sites, content need to be updated very frequently.There is no easy way for business people to update the content. As a developer, we can provide an option to business users to update the content by providing them Admin interfaces. But with this option, there is a risk of building and maintaining the Admin interfaces, and there is a lot of time involved in it. What if someone else provide the interfaces, we can concentrate on core development of building the website.This is where Content Management Systems come into picture. Content Management System helps business users (non-technical) to easily manage their content via web interface. 3. What is Sitecore?Sitecore at its essence is a Content Management System, but it is much more than that. “Sitecore Experience Platform is a ‘blended’ solution – it combines web content management with a marketing platform.”Sitecore provides an end to end solution which deals with Content management system and Digital marketing system under one platform as per corporate needs. 4. I am a .NET developer, am I suitable for Sitecore development?Yes, As Sitecore is built on .NET stack, it is best suited for .NET developer to learn and work on Sitecore implementations. 5. As a .NET developer, how does it benefit to learn Sitecore?There are around 4,900+ brands are using Sitecore, and more and more brands are embracing Sitecore. So, more demand for Sitecore developers. As a developer it is good career option to explore, and importantly, you will still be working on .NET tech stack. 6. Pre-requisites to start learning Sitecore?Decent amount of knowledge on the .NET technologies, like ASP.NET MVC/Web forms, C#, SQL server (although mostly we don’t write SQL queries), and basic understanding of HTML, JavaScript and JQuery. 7. Where will I get Sitecore documentation?Please refer official Sitecore documentation. 8. Sitecore, Is it free?No, it comes with license fee. Code is also not open source. 10. Some of the Indian companies, where they recruit Sitecore developers?As per my knowledge, following are some of the organizations, Verndale Epsilon Sapient Accenture Mindtree HCL Unicolumn Software PVT LTD, Horizontal Integration For more info, explore http://www.sitecore.net/en/getting-started/partners/search-partners 11. From .NET background, where should I start learning Sitecore?Sitecore recently launched a foundation course called Sitecore Developer Foundations, which is free, and covers Sitecore basics. Although course is free, you need a license to practice, you can approach Sitecore sales/support to get further information on trial license. 12. Can I develop my personal website on Sitecore?Sitecore XP is an Enterprise level Content Management system, it is overkill to use it for personal websites. It is not free; you need to pay license fee. 13. What are all the Sitecore databases?On very light node Sitecore uses both SQL Server (minimal support to Oracle) and Mongo DB databases; SQL Server databases are for content, and Mongo DB databases for analytics. You can find more details here. 14. Can I modify Sitecore databases Schema?It is not advisable, if any extra tables are required we can create a custom database, and use it. 15. Can Sitecore solutions be deployed on Cloud?Yes, previously you can do it only using Infrastructure As a Service (IAAS), but recently Sitecore by collaborating with Microsoft, released Platform As a Service (PAAS) tools. Now we can easily deploy using PAAS as well. 16. Is Sitecore available as Software As a Service (SAAS)?No, Sitecore is not a portal kind of solution, which can be used as SAAS. Sitecore provides a platform for developers to implement Sitecore solutions, clients can not directly use Sitecore vanilla version. 17. How can I create user input forms in Sitecore?Sitecore provides Web Forms For Marketers (WFFM) module, using which you can create simple web forms that record and report information provided by visitors to your website. 18. Where does Sitecore stores content managed images?Sitecore provides two options; In Database or file system; Options are configurable. 19. Where does Sitecore stores content managed Videos?Usually videos are integrated from external media platforms like Brightcove, Ooyala, YouTube, and Vimeo etc. Only Video information gets imported into Sitecore, not the Video file. 20. Are there any Sitecore developer certifications?Yes, there is a Sitecore Professional Developer Certification, which developer get Sitecore Certified Professional Developer title. Will keep adding more questions and answers. Happy Learning :)","categories":[{"name":"Sitecore","slug":"Sitecore","permalink":"http://gopigujjula.com/categories/Sitecore/"}],"tags":[{"name":"Sitecore","slug":"Sitecore","permalink":"http://gopigujjula.com/tags/Sitecore/"},{"name":"Beginner","slug":"Beginner","permalink":"http://gopigujjula.com/tags/Beginner/"}]},{"title":"Saturday Sitecore Learning - Templates Part 4 (Link Field Types)","slug":"Saturday-Sitecore-Learning-Template-Part-4","date":"2017-02-04T02:47:00.000Z","updated":"2017-07-30T07:10:03.209Z","comments":true,"path":"2017/02/Saturday-Sitecore-Learning-Template-Part-4/","link":"","permalink":"http://gopigujjula.com/2017/02/Saturday-Sitecore-Learning-Template-Part-4/","excerpt":"","text":"Link Field TypesThis is the fourth post as part of Sitecore Template series. Sitecore 8.2 (rev. 160729) In last two posts, we discussed about Simple field types &amp; List field types, now let’s look into Link field types. Link types:Link field types allow content authors to enter links to Sitecore internal items, external URLs, anchors, and email addresses. Droplink: Similar to the Droplist field type, which we had seen in the previous post, this field type also allows the content author to select a single item from the list specified by the source property of the field. If the source is not set, no items are shown in the drop-down.Field source can be set while declaring the field, using Source property.Raw value: Selected Item GUIDField type class: Sitecore.Data.Fields.RefernceFieldField Renderer supported: NoAllowed format in source field property: GUID, Path, and XPath Query Droptree: This field type also allows the content author to select a single item from the list specified by the source property of the field. Items are shown in tree-view rather than the normal drop-down. If the source is not set, it shows the entire tree.Raw value: Selected Item GUIDField type class: Sitecore.Data.Fields.RefernceFieldField Renderer supported: NoAllowed format in source field property: GUID, Path, and XPath Query General Link: This is the most frequently used link field type. This type allows content authors to link to a Sitecore item, an external URL, an anchor, an email address, or a JavaScript function.Raw value: XHTMLField type class: Sitecore.Data.Fields.LinkFieldField Renderer supported: Yes General Link with Search: This is similar to General Link field type, except that this one is having an extra link search functionality. Using this, content authors can search (for Internal link) and link to items.Recently we come across a scenario where clients want to search for an item to link, because it is tedious for them to navigate to that item, (we can use other field types, but they want to ) this field type came to our rescue :)Raw value: XHTMLField type class: Sitecore.Data.Fields.LinkFieldField Renderer supported: Yes Version Identity: and Version Link: field types are used by Sitecore for internal purposes. Till now we looked into Simple, List, and field types. But there are other field types which are not so frequently used by developers. Analytics Social Developer Types System Types Raw value: A value which gets stored in the database for each field.Field type class: Using which developer can access the field values.Field Renderer supported: Field type has corresponding FieldRenderer web control, when used, content authors can use Experience editor to manage the content for particular field. References: https://sdn.sitecore.net/upload/sitecore6/65/data_definition_reference_sc64-65-usletter.pdf http://www.mtelligent.com/home/2014/8/29/sitecore-field-type-overview-reference.html Happy Learning :)","categories":[{"name":"Sitecore","slug":"Sitecore","permalink":"http://gopigujjula.com/categories/Sitecore/"},{"name":"Saturday Sitecore Learning","slug":"Sitecore/Saturday-Sitecore-Learning","permalink":"http://gopigujjula.com/categories/Sitecore/Saturday-Sitecore-Learning/"},{"name":"Templates","slug":"Sitecore/Saturday-Sitecore-Learning/Templates","permalink":"http://gopigujjula.com/categories/Sitecore/Saturday-Sitecore-Learning/Templates/"},{"name":"Field Types","slug":"Sitecore/Saturday-Sitecore-Learning/Templates/Field-Types","permalink":"http://gopigujjula.com/categories/Sitecore/Saturday-Sitecore-Learning/Templates/Field-Types/"}],"tags":[{"name":"Sitecore","slug":"Sitecore","permalink":"http://gopigujjula.com/tags/Sitecore/"},{"name":"Beginner","slug":"Beginner","permalink":"http://gopigujjula.com/tags/Beginner/"},{"name":"Saturday Sitecore Learning","slug":"Saturday-Sitecore-Learning","permalink":"http://gopigujjula.com/tags/Saturday-Sitecore-Learning/"},{"name":"Sitecore Field Types","slug":"Sitecore-Field-Types","permalink":"http://gopigujjula.com/tags/Sitecore-Field-Types/"}]},{"title":"Verndale Steps Challenge - 2017","slug":"Verndale-Steps-Challenge-2017","date":"2017-02-04T00:47:00.000Z","updated":"2017-02-11T01:52:25.797Z","comments":true,"path":"2017/02/Verndale-Steps-Challenge-2017/","link":"","permalink":"http://gopigujjula.com/2017/02/Verndale-Steps-Challenge-2017/","excerpt":"","text":"Verndale Steps Challenge participation ExperienceFrom childhood I always love walking and running. Walking gives me pleasure, releases my stress, and improves my thinking. Even though I love walking, I am not regular about it, only when I feel to walk, then only I do it. Sometimes if I am stuck up on something, like need to take a critical decision, or to resolve an issue, then walking helps me to think clearly. After I became a Software engineer, Walking helped me to solve lot of developer road blocks. Around 4 months back (Sep-2016), my friend from USA gifted me with Power beats wireless earphones, and jawbone Up fitness tracker. once I received both of them, started morning walk for couple twice a week, with 2 to 3 km distance at a time. Verndale Steps ChallengeIn December-2016, there was an announcement in office, about holding a month long, companywide steps and run challenge. The challenge is based on the number of miles walked or ran. Immediately, I was interested to participate in steps challenge, and signed up for it. This challenge is going to be tracked on Endomondo (a free fitness app). so downloaded the app, and ready for the challenge. While signing up, my thoughts are like, anyway I am going to morning walk for twice a week. So for this challenge, will make it regular, and increase the distance up to 5 km per day, that may give chance to top in the list. So daily 5km, means end of the month it will be 150km, this will be more than enough. (Little did I know that, 150km is no where near, and I will finish the challenge with 510km.) Challenge runs from 3rd Jan 2017 to 3rd Feb 2017. But I started regular walk from 2nd Jan (1 day before), to see whether I can actually walk for 5km in a single workout. It was ok, I was able to walk 5km with ease, and felt good about it. Once Challenge is started, and many of my Bangalore colleagues also signed up for it, so in tea time, we used to have fun discussion about the challenge. These discussions continued for whole month. First time 10km walk After initial days of the challenge are over, understood that 5km are not going to be enough. One day wanted to try for 10km, I know that It’s very long for a single workout. Somehow believed, I could make it. By the time I reached 7-8 km, my legs are paining like hell, thought of giving up there, but don’t know what happened, I was determined to finish that 10kms. Pushed myself for another 2kms, and was able to finish 10 km. This is one of the most memorable experience, in the whole journey. Looking back, I feel proud of myself, that I could cross that 10kms. Later 10km became a regular distance for my workout. As the days are passing, intensity in the competition has also increased, I also needed to keep up my pace. Lake park: I like walking beside the lake, love the morning breeze, sunrise, and everything around there. Every day I had some wonderful experience there, like meeting new people, and inspired by some of their determination. When I go for walk in other parks, I couldn’t spend so much time there, as I don’t get the same breeze, always wish to go to lake park. Music &amp; Podcasts: Power beats are very useful in this journey. While walking, I love to listen Music, especially Telugu (mother tongue) songs. But this time I also explored another stream which are podcasts. I know about podcasts before, but here and there I used to listen only an episode from Hansel minutes) podcast. This time, as I am walking long distances, wanted to explore podcasts fully. I listened to some of the wonderful episodes from different podcasts, and now I am following lot of good podcasts like, CoreSampler Hansel Minutes Hello World Podcast .NET Rocks Telugu Bytes I also listened to Anthem by Ayn Rand audio book. Last day of the challenge I wanted to finish it on a high note, in morning I increased my pace, and reached maximum single workout distance of 17km, and also maximum distance per day 27.5km. Irrespective of the result, by participating in this challenge, I am left with so many wonderful memories, and first time covered 10km, 15km, and 17km distance. In my wildest thoughts also, I would have not guessed, that I can walk for 510km in a month. It made to me to push my limits in all possible ways. Image courtesy http://www.audiosplitz.com/2016/04/beats-powerbeats2-wireless.html","categories":[],"tags":[{"name":"Walking","slug":"Walking","permalink":"http://gopigujjula.com/tags/Walking/"},{"name":"Workout","slug":"Workout","permalink":"http://gopigujjula.com/tags/Workout/"}]},{"title":"Saturday Sitecore Learning - Templates Part 3 (List Field Types)","slug":"Saturday-Sitecore-Learning-Template-Part-3","date":"2017-01-28T02:47:00.000Z","updated":"2017-07-30T07:10:03.159Z","comments":true,"path":"2017/01/Saturday-Sitecore-Learning-Template-Part-3/","link":"","permalink":"http://gopigujjula.com/2017/01/Saturday-Sitecore-Learning-Template-Part-3/","excerpt":"","text":"List Field TypesThis is the third post as part of Sitecore Template series. Sitecore 8.2 (rev. 160729) In the previous post, we discussed about Simple field types, in this post let’s look into List field types. List types:List type fields allow content authors to select one or multiple values, ex: countries, categories, etc. Multilist: This is one of the most commonly used list type, using this type, content authors can choose one or more items, from the list, which are based on the source property of the field specified. If the field source is not specified, selectable list becomes empty. Field source can be set while declaring the field, using Source property.Raw value: Pipe separated GUID’sField type class: Sitecore.Data.Fields.MultilistFieldField Renderer supported: NoAllowed format in source field property: GUID, Path, and XPath Query Multilist with Search: This is similar to Multilist field type, but having a search functionality. When there are large number of selectable items, this field type aids content authors to search and choose items.Raw value: Pipe separated GUID’sField type class: Sitecore.Data.Fields.MultilistFieldField Renderer supported: NoAllowed format in source field property: GUID, Path, and XPath Query Treelist: This list type, lists all the selectable items in tree structure, including the parent item. If no source is specified, it will list whole Sitecore tree.Raw value: Pipe separated GUID’sField type class: Sitecore.Data.Fields.MultilistFieldField Renderer supported: NoAllowed format in source field property: GUID, Path, XPath Query, and query string TreelistEx: This is pretty much similar to Treelist, except that for this field type, the selection option will be opened in a new browser window (pop up); when no source is specified, this also lists the entire tree. TreelistEx field type performance is better than Treelist field type, because for TreelistEx, the client renders only the list of selected items, and does not render the selection tree until the user clicks the Edit command which is present above the field.Raw value: Pipe separated GUID’sField type class: Sitecore.Data.Fields.MultilistFieldField Renderer supported: NoAllowed format in source field property: GUID, Path, XPath Query, and query string Checklist: The list type allows the user to select one or more checkboxes representing the children of the item specified by Source property of the field. Unlike other list types, content authors cannot order their selection.Raw value: Pipe separated GUID’sField type class: Sitecore.Data.Fields.MultilistFieldField Renderer supported: NoAllowed format in source field property: GUID, Path, XPath Query Droplist: The Droplist field type allows the content author to select a single item from the list specified by the Source property of the field.Raw value: string (name of the selected item)Field Renderer supported: NoAllowed format in source field property: GUID, Path, XPath Query Grouped Droplist: This field type allows content author to select a single grandchild of the item specified by Source property of the field. This type stores the name of selected item.Raw value: string (name of the selected item)Field Renderer supported: NoAllowed format in source field property: GUID, Path, XPath Query Grouped Droplink: This is very much similar to Grouped Droplist field type, except that, The Grouped Droplink field type stores the GUID of the selected item.Raw value: GUID (ID of the selected item)Field type class: Sitecore.Data.Fields.ReferenceFieldField Renderer supported: NoAllowed format in source field property: GUID, Path, XPath Query Name Value List: This field type allows the content authors to enter values in key-value pairs. When first key, value pair is entered, another row will appear to enter next set of values. Sitecore stores the values entered as a list of key=value pairs separated by ampersands (“&amp;”). I had seen this in real time for Brightcove media framework, for each Brightcove video item, we have custom fields getting imported in name-value pairs.Raw value: key=value pairs separated by ampersands (“&amp;”)Field type class: Sitecore.Data.Fields.NameValueListFieldField Renderer supported: No Name Lookup Value List: This field type is similar to Name Value List field type, in Name Value List, content author has to enter both key &amp; value pair, but here content authors enters keys, and for value choose an item from populated drop-down list.Raw value: key=value pairs separated by ampersands (“&amp;”)Field type class: Sitecore.Data.Fields.NameValueListFieldField Renderer supported: No Raw value: A value which gets stored in the database for each field.Field type class: Using which developer can access the field values.Field Renderer supported: Field type has corresponding FieldRenderer web control, when used, content authors can use Experience editor to manage the content for particular field. In next post, will look into Link types. References: https://sdn.sitecore.net/upload/sitecore6/65/data_definition_reference_sc64-65-usletter.pdf http://www.mtelligent.com/home/2014/8/29/sitecore-field-type-overview-reference.html http://getfishtank.ca/blog/treelist-data-source-hidden-functionality https://exploringsitecore.wordpress.com/category/sitecore/name-value-list-sitecore/ Happy Learning :)","categories":[{"name":"Sitecore","slug":"Sitecore","permalink":"http://gopigujjula.com/categories/Sitecore/"},{"name":"Saturday Sitecore Learning","slug":"Sitecore/Saturday-Sitecore-Learning","permalink":"http://gopigujjula.com/categories/Sitecore/Saturday-Sitecore-Learning/"},{"name":"Templates","slug":"Sitecore/Saturday-Sitecore-Learning/Templates","permalink":"http://gopigujjula.com/categories/Sitecore/Saturday-Sitecore-Learning/Templates/"},{"name":"Field Types","slug":"Sitecore/Saturday-Sitecore-Learning/Templates/Field-Types","permalink":"http://gopigujjula.com/categories/Sitecore/Saturday-Sitecore-Learning/Templates/Field-Types/"}],"tags":[{"name":"Sitecore","slug":"Sitecore","permalink":"http://gopigujjula.com/tags/Sitecore/"},{"name":"Beginner","slug":"Beginner","permalink":"http://gopigujjula.com/tags/Beginner/"},{"name":"Saturday Sitecore Learning","slug":"Saturday-Sitecore-Learning","permalink":"http://gopigujjula.com/tags/Saturday-Sitecore-Learning/"},{"name":"Sitecore Field Types","slug":"Sitecore-Field-Types","permalink":"http://gopigujjula.com/tags/Sitecore-Field-Types/"}]},{"title":"Saturday Sitecore Learning - Templates Part 2 (Simple Field Types)","slug":"Saturday-Sitecore-Learning-Template-Part-2","date":"2017-01-21T07:30:00.000Z","updated":"2017-07-30T07:10:03.192Z","comments":true,"path":"2017/01/Saturday-Sitecore-Learning-Template-Part-2/","link":"","permalink":"http://gopigujjula.com/2017/01/Saturday-Sitecore-Learning-Template-Part-2/","excerpt":"","text":"Template FieldsThis is the second post as part of Sitecore Template series. Sitecore 8.2 (rev. 160729) In this post, let’s discuss about fields, and their types. If we think of a template as a class, then fields are properties of that class. We can consider each field is container for the individual piece of content (image, link, text, list, etc.), and using this fields Content Authors can add/update their content. How each property of the class has its own type, similar way each template field also has its own field type. Field type determines, three things What type of content (normal text, rich text, image etc.) can be entered into the field, What type of control (Single line text, Rich text editor, etc.) need to be shown to content authors to enter their data, In what format the value is stored in the database. Out of the box Sitecore provides lot of field types, but based on the requirement, developers can create custom field types. From requirements, or from design, developer has to infer the fields &amp; corresponding field types required for particular page, or module. We can classify/categorize field types as shown below, Simple types List types Link types Let’s look into each type in detail, Simple types:The Simple type field contains individual values, like a text, integer, or date value. Single-Line Text: This is one of the most commonly used field type, and also the simplest one. It is similar to a HTML textbox control, and allows content authors to enter simple text.Raw value: stringField type class: Sitecore.Data.Fields.TextFieldField Renderer supported: Yes Multi-Line Text: As the name suggests this type is used when we have multiple lines of text/comments to be added. This is similar to HTML textarea control.Raw value: stringField type class: Sitecore.Data.Fields.TextFieldField Renderer supported: Yes Rich Text: This field type allows content authors to enter large text with media items, and also allows to modify HTML. This is similar to WYSIWYG editor.Raw value: XHTMLField type class: Sitecore.Data.Fields.TextFieldField Renderer supported: Yes Integer: This field type allows content authors to enter whole number. It’s also similar to HTML textbox control.Raw value: stringField type class: Sitecore.Data.Fields.TextFieldField Renderer supported: Yes Number: This field type allows content authors to enter decimal values. It’s also similar to HTML textbox control.Raw value: stringField type class: Sitecore.Data.Fields.TextFieldField Renderer supported: Yes Password: This field type is used for passwords, where characters in the field are masked. It is similar to HTML input control with password type.Raw value: stringField type class: Sitecore.Data.Fields.TextField Date &amp; Date Time: As the name suggests both of these field types are used for date &amp; date time respectively. This field types allow content authors to select or manually enter the data and time. These are similar to HTML input control with date type.Raw value: string (ISO 8601 formatted date-time, yyyyMMddThhmmss)Field type class: Sitecore.Data.Fields.DateFieldField Renderer supported: Yes Checkbox: This field type allows content authors to check/uncheck a particular value, and it’s similar to HTML input control with checkbox type. It contains either 0 or 1 value.Raw value: 0 or 1Field type class: Sitecore.Data.Fields.CheckboxFieldField Renderer supported: No Image: This field type allows content authors to select an image from the media library and specify image properties.Raw value: xmlField type class: Sitecore.Data.Fields.ImageFieldField Renderer supported: Yes File: This field type allows the user to select an item in the media library. Users can click Open file to open the Media Browser and select the desired file from the media library.We can use the Source property of a File field to control the media folder selected when the content author opens the Media Browser, or to specify the root item for this selection interface.Raw value: xmlField type class: Sitecore.Data.Fields.FileFieldField Renderer supported: No Word Document: The Word Document field type allows the content authors to edit HTML using Microsoft Word embedded in the browser. (I have not yet used this field, and it is only supported in IE browser)Raw value: xmlField type class: Sitecore.Data.Fields.WordDocumentField Raw value: A value which gets stored in the database for each field.Field type class: Using which developer can access the field values.Field Renderer supported: Field type has corresponding FieldRenderer web control, when used, content authors can use Experience editor to manage the content for particular field. In coming posts, will look into List and Link types. References: https://sdn.sitecore.net/upload/sitecore6/65/data_definition_reference_sc64-65-usletter.pdf http://www.mtelligent.com/home/2014/8/29/sitecore-field-type-overview-reference.html http://getfishtank.ca/blog/using-date-and-datetime-fields-in-sitecore Happy Learning :)","categories":[{"name":"Sitecore","slug":"Sitecore","permalink":"http://gopigujjula.com/categories/Sitecore/"},{"name":"Saturday Sitecore Learning","slug":"Sitecore/Saturday-Sitecore-Learning","permalink":"http://gopigujjula.com/categories/Sitecore/Saturday-Sitecore-Learning/"},{"name":"Templates","slug":"Sitecore/Saturday-Sitecore-Learning/Templates","permalink":"http://gopigujjula.com/categories/Sitecore/Saturday-Sitecore-Learning/Templates/"},{"name":"Field Types","slug":"Sitecore/Saturday-Sitecore-Learning/Templates/Field-Types","permalink":"http://gopigujjula.com/categories/Sitecore/Saturday-Sitecore-Learning/Templates/Field-Types/"}],"tags":[{"name":"Sitecore","slug":"Sitecore","permalink":"http://gopigujjula.com/tags/Sitecore/"},{"name":"Beginner","slug":"Beginner","permalink":"http://gopigujjula.com/tags/Beginner/"},{"name":"Saturday Sitecore Learning","slug":"Saturday-Sitecore-Learning","permalink":"http://gopigujjula.com/tags/Saturday-Sitecore-Learning/"},{"name":"Sitecore Field Types","slug":"Sitecore-Field-Types","permalink":"http://gopigujjula.com/tags/Sitecore-Field-Types/"}]},{"title":"Saturday Sitecore Learning - Sitecore Enhancing Content Author Experience","slug":"Saturday-Sitecore-Learning-Enhancing-Content-Author-Experience","date":"2017-01-14T05:30:00.000Z","updated":"2017-07-26T08:56:53.286Z","comments":true,"path":"2017/01/Saturday-Sitecore-Learning-Enhancing-Content-Author-Experience/","link":"","permalink":"http://gopigujjula.com/2017/01/Saturday-Sitecore-Learning-Enhancing-Content-Author-Experience/","excerpt":"","text":"Experience on giving first talk in Sitecore User Group BangaloreBack after a month break, from next week we will restart our Sitecore Saturday learning series. This week I am going to share my experiences on giving first ever presentation in any technical user group. Previously I had experience on giving presentations either within the team, or within the organization, but never in any technical user group. I regularly participate in technical user groups, in and around Bangalore, and also in some of the virtual user groups (webinars). This expands my knowledge, helps in understanding new trends, buzzwords, and also to update my skills. In last November, I had given a Sitecore knowledge share session in my organization. As my friends were also interested in the topic, then got the idea of why not give this session in Sitecore user group, but this is completely out of my comfort zone. Lot of thoughts runs in my mind, previously also many times got the same idea, but every time dropped it because of my discomfort. This time there was an urge to do it at any cost. Always do what you are afraid to do. -Ralph Waldo Emerson After much deliberation, one day mailed my willingness to present, and other relevant information to SUG Bangalore. Annie was very encouraging, and also gave some tips on presentation. After a short communication through emails we decided on a date (07-January-2017) and announced it. By that time, I had finished with presentation deck, and local demo site, and also practiced the talk to follow time constraint (should have practiced more). As it is a Webinar, one day before, we did a dry run in my system, and all set for go live. On 7th morning when I woke up to practice once more, my demo site is down. It was just 2 hours before the session, there are only two options, either setup the site again, or make the existing site up. I choose the first option, as there was not much time in digging the issue. Quickly I had setup the site again (thanks to Sitecore Instance Manager), and created all the necessary items. In my area power is not so reliable, so decided to give the talk from office. Going to office on Saturdays is completely different experience, thanks to Haribabu for accompanying me. When session started, I was lot nervous, slowly getting into comfort zone with ease. As it is a webinar (can’t see audience faces), I couldn’t decide exactly on where I need to slow down, or increase my speed, and same case with screen zoom in or zoom out. But somehow I was able to finish up within the time. Only two things are in my mind while preparing &amp; giving the presentation, Should not give any misleading or false information. Try to be relevant to the targeted audience as much as possible. I hope my session was useful at least to one person, then my target is accomplished. Presentation Deck: Webinar Video: More details about the talk can be found here In coming months, some of the topics I am thinking of presenting are, Sitecore Media Framework with Brightcove (Two parts) Sitecore Goals from Developer perspective Search: Absolute basics Niche topics: Sitemap, SEO Metadata, URL redirects, 400 not found, 500 server error page, and RSS feeds. Sitecore What, Why &amp; How: For .NET developers who never heard of Sitecore. T4 templates &amp; code generation. User groups I regularly participate are, Sitecore User Group Bangalore BDotnet Dotnet Bangalore Software Architects Bangalore Microsoft Azure User Group-Bangalore Scrum Bangalore Thanks to Annie &amp; Haribabu for their support and encouragement.","categories":[{"name":"Sitecore","slug":"Sitecore","permalink":"http://gopigujjula.com/categories/Sitecore/"},{"name":"Tech Talks","slug":"Sitecore/Tech-Talks","permalink":"http://gopigujjula.com/categories/Sitecore/Tech-Talks/"}],"tags":[{"name":"Sitecore","slug":"Sitecore","permalink":"http://gopigujjula.com/tags/Sitecore/"},{"name":"Beginner","slug":"Beginner","permalink":"http://gopigujjula.com/tags/Beginner/"},{"name":"Presentation","slug":"Presentation","permalink":"http://gopigujjula.com/tags/Presentation/"},{"name":"Sitecore User Group","slug":"Sitecore-User-Group","permalink":"http://gopigujjula.com/tags/Sitecore-User-Group/"},{"name":"SUG Bangalore","slug":"SUG-Bangalore","permalink":"http://gopigujjula.com/tags/SUG-Bangalore/"},{"name":"Saturday Sitecore Learning","slug":"Saturday-Sitecore-Learning","permalink":"http://gopigujjula.com/tags/Saturday-Sitecore-Learning/"}]},{"title":"Saturday Sitecore Learning - Templates Part-1","slug":"Saturday-Sitecore-Learning-Template-Part-1","date":"2016-12-10T07:30:00.000Z","updated":"2017-02-26T11:03:21.309Z","comments":true,"path":"2016/12/Saturday-Sitecore-Learning-Template-Part-1/","link":"","permalink":"http://gopigujjula.com/2016/12/Saturday-Sitecore-Learning-Template-Part-1/","excerpt":"","text":"As part of Saturday Sitecore Learning series, till now we looked into, What is CMS? What is Sitecore? Sitecore installation (I prefer using SIM) Setting up Visual Studio Solution (Outside webroot) About Sitecore Databases Exploring Default home page By this time, I assume that you have both Sitecore and Visual Studio project setups in your machine, If not, please go through these two posts, Sitecore installation, Setting up Visual Studio Solution and try setting them up. From now onwards we will look into core Sitecore concepts in more detail manner. First let’s explore one of the important part of Sitecore, which are Templates. Understanding the Templates, is very important for developers, as selecting the correct template type, dictates overall experience of managing content. Templates is a very vast topic, and can’t be covered in a single post, so it will be spanning across multiple posts. Template FundamentalsTemplates, also commonly referred as Data Templates, which are basic building blocks of any content in Sitecore. Every piece of content (page or components) in Sitecore needs a data template to define what it is. To understand it better, Templates can be compared to Class (In object oriented programming) definitions, Each Class contain fields with their respective data types, similarly every Template contain fields, with their respective field types. (Ex: Single-line text) Any number of instances can be created based on a class, similarly we can create any number of content items based on a single template. Class supports inheritance, similarly templates also supports inheritance, in which a single template can inherit from multiple base templates, to mainly share the common fields. Before creating any content, first we need to create a Template with fields and their types. In a nutshell, Templates specify the data fields and many other settings that can be applied to content upon creation. All Templates are defined under /sitecore/templates in Sitecore tree structure. To open templates, we can open them either from Content Editor, or from Template Navigator, which is present in Start menu. (Start menu is available in Desktop mode) While exploring default home page, we noticed that home page content item, is using Sample item template, which can be found in /sitecore/templates/Sample/Sample Item Following are some of the terms, we need to understand, before we do hands on creating templates. Let’s look into each of them more detail in coming up posts. Fields - Field Sections, Field Types, Field Source, and Field Validation. Template Inheritance Standard Values Template types In next post we will look into Sitecore fields. References Professional Sitecore 8 development - http://www.apress.com/us/book/9781484222911 Happy Learning :)","categories":[{"name":"Sitecore","slug":"Sitecore","permalink":"http://gopigujjula.com/categories/Sitecore/"},{"name":"Saturday Sitecore Learning","slug":"Sitecore/Saturday-Sitecore-Learning","permalink":"http://gopigujjula.com/categories/Sitecore/Saturday-Sitecore-Learning/"},{"name":"Templates","slug":"Sitecore/Saturday-Sitecore-Learning/Templates","permalink":"http://gopigujjula.com/categories/Sitecore/Saturday-Sitecore-Learning/Templates/"}],"tags":[{"name":"Sitecore","slug":"Sitecore","permalink":"http://gopigujjula.com/tags/Sitecore/"},{"name":"Beginner","slug":"Beginner","permalink":"http://gopigujjula.com/tags/Beginner/"},{"name":"Saturday Sitecore Learning","slug":"Saturday-Sitecore-Learning","permalink":"http://gopigujjula.com/tags/Saturday-Sitecore-Learning/"}]},{"title":"Saturday Sitecore Learning - Default Home Page","slug":"Saturday-Sitecore-Learning-Default-Home-Page","date":"2016-12-03T05:30:00.000Z","updated":"2017-06-25T17:41:13.397Z","comments":true,"path":"2016/12/Saturday-Sitecore-Learning-Default-Home-Page/","link":"","permalink":"http://gopigujjula.com/2016/12/Saturday-Sitecore-Learning-Default-Home-Page/","excerpt":"","text":"As I explained on how to install Sitecore and setup new project in my previous posts, Now it’s time to drill down on the Sitecore default home page. Let’s explore it’s Template, Layout, sub-layout, Content Item etc. At last we will see how the Content Author can change the text using Content editor. Before we move further, few of you may not be convenient with terminology (template, layout, sub-layout) but no issues just follow the steps, we will discuss more about each topic in coming posts. If we load the newly installed Sitecore website, we can see the below page, as the website home page. Now let’s look into each and every aspect from Sitecore side, first let’s login into Sitecore using admin/b credentials, From Launch pad, navigate to Content Editor, by directly clicking on the Content Editor option, or through Desktop option, it is a good practice to go from Desktop, as we can open multiple windows, and navigate among them, similar to windows desktop, and also having start menu. This is not possible by directly selecting Content Editor option from Launch pad. If you click on Desktop mode, select Sitecore logo/start button and select “Content Editor” option. In Content Editor, navigate to the Home content item (/sitecore/content/Home), Data Template:In Sitecore, every content item is created from Template. Template contains field definition, and presentation information. Some say “Templates are like class definitions. Content is like an instance of that class.”In Sitecore tree, all the templates are present under sitecore/Templates For the default “Home” page Template is already present in Templates section. We can see the Template name, In Quick Info section, which is Sample Item in this case. By clicking on the template name, we can navigate to the template item.(if you opened in Desktop mode, Template will be opened in new window, else on the same window) or we can navigate to the template using its path /sitecore/templates/Sample/Sample Item. By looking into Sample Item Template’s Builder tab, we can understand that there are two fields defined in it, which are Title (text Type) and Text (Rich Text Type). Field Type determines the control to manage the content by content author using the editing interface. Standard Values for a particular template, lists all the fields including inherited fields. All the presentation details are assigned on Standard values.For all the page templates, we have a presentation, where we can assign a layout and components (sub-layouts). On request of a web page, Sitecore assembles the page dynamically from it’s content and the presentation components. Presentation:Now let’s look into presentation components, both layout, and sub layouts. All the layouts, sub layouts, renderings (in MVC), will be present under sitecore/Layout in the Sitecore tree. From Sample Item template presentation, we can see that there is one layout (Sample Layout), and three components (Sample Sublayout, Sample Inner Sublayout, and Sample Rendering). Let’s explore Sample Layout first, which is present in sitecore/Layout/Layouts/ path. Layout is kind of master page in ASP.NET terminology, where we have basic html tags are added, and placeholders are defined. On Click of Sample Layout item, we can see the Path field, there is a .aspx page path is given, which contains all the HTML code with respect to the page. If we observe the layout code, we can see that HTML tags are present and also a placeholder with key as main is added. This is the placeholder where, other page components are going to be embedded. Similar way if we look at Sample Sublayout item, which is under /sitecore/Layout/Sublayouts. This is an .ascx file. Similar to this component, other page components also have code files with respect to them.ASP.NET webforms -&gt; .ascx filesASP.NET MVC -&gt; Controller rendering, or View rendering.XSLT -&gt; XSL Rendering If we look at the Sample rendering which is a xsl rendering, this is where we are rendering both the fields, ‘title’ &amp; ‘text’, which are created in template. Now let’s get back to our home item, where we have already content present for both the fields, which we can see on home page. Till now we have seen Templates, Standard values, presentation, layout, sub-layout and renderings. Stay tune to this space for my next posts to discuss more detail on each item we used in home page. Hello WorldWe will try changing the Title field content to Hello World, and verify that text is changing on home page or not. After making any change, we need to publish the item; As I discussed earlier our changes will save in to Master database. On Click of publish latest modifications/final content gets pushed to web database. Refer Below screenshot for final output we are expecting. Hello world is indeed appearing on home page. Sitecore supports both ASP.NET web forms and MVC, but default home page comes with all web forms related code. Currently most of new Sitecore implementations are done in MVC. So in coming up posts, we will always try to see the code examples in MVC.ASP.NET web forms is still very much in picture, because lot of implementations till now are done in web forms. Whenever we are maintaining those applications, web forms knowledge is very much required.That’s all for this week. Happy Learning :)","categories":[{"name":"Sitecore","slug":"Sitecore","permalink":"http://gopigujjula.com/categories/Sitecore/"},{"name":"Saturday Sitecore Learning","slug":"Sitecore/Saturday-Sitecore-Learning","permalink":"http://gopigujjula.com/categories/Sitecore/Saturday-Sitecore-Learning/"}],"tags":[{"name":"Sitecore","slug":"Sitecore","permalink":"http://gopigujjula.com/tags/Sitecore/"},{"name":"Beginner","slug":"Beginner","permalink":"http://gopigujjula.com/tags/Beginner/"},{"name":"Saturday Sitecore Learning","slug":"Saturday-Sitecore-Learning","permalink":"http://gopigujjula.com/tags/Saturday-Sitecore-Learning/"}]},{"title":"Saturday Sitecore Learning - Sitecore Code review check list","slug":"Saturday-Sitecore-Learning-Sitecore-Basic-Code-Review-Checklist","date":"2016-11-26T05:30:00.000Z","updated":"2017-03-28T17:28:22.557Z","comments":true,"path":"2016/11/Saturday-Sitecore-Learning-Sitecore-Basic-Code-Review-Checklist/","link":"","permalink":"http://gopigujjula.com/2016/11/Saturday-Sitecore-Learning-Sitecore-Basic-Code-Review-Checklist/","excerpt":"","text":"This week, I am going away from our series, and sharing the presentation on the Sitecore basic code review check list. This presentation deck is part of the knowledge share session, I had delivered in office. This check list helps Sitecore developers to better enhance the Content Author experience in managing their content. Happy Learning :)","categories":[{"name":"Sitecore","slug":"Sitecore","permalink":"http://gopigujjula.com/categories/Sitecore/"},{"name":"Saturday Sitecore Learning","slug":"Sitecore/Saturday-Sitecore-Learning","permalink":"http://gopigujjula.com/categories/Sitecore/Saturday-Sitecore-Learning/"}],"tags":[{"name":"Sitecore","slug":"Sitecore","permalink":"http://gopigujjula.com/tags/Sitecore/"},{"name":"Beginner","slug":"Beginner","permalink":"http://gopigujjula.com/tags/Beginner/"},{"name":"Presentation","slug":"Presentation","permalink":"http://gopigujjula.com/tags/Presentation/"},{"name":"Saturday Sitecore Learning","slug":"Saturday-Sitecore-Learning","permalink":"http://gopigujjula.com/tags/Saturday-Sitecore-Learning/"}]},{"title":"Saturday Sitecore Learning - Sitecore Databases","slug":"Saturday-Sitecore-Learning-Sitecore-Databases","date":"2016-11-19T05:30:00.000Z","updated":"2017-02-26T11:03:21.135Z","comments":true,"path":"2016/11/Saturday-Sitecore-Learning-Sitecore-Databases/","link":"","permalink":"http://gopigujjula.com/2016/11/Saturday-Sitecore-Learning-Sitecore-Databases/","excerpt":"","text":"By this time, we have Sitecore website running in our machine, and also ready with Visual Studio solution setup. From now, we will look into Sitecore concepts, in both theory and hands on as well.As we all know Sitecore is a database driven CMS, in this post let’s look into Sitecore databases. Sitecore Databases:From developer’s perspective, until and unless any customization is required, we don’t directly deal with databases, we always access data using Sitecore Api’s. but it is very important to know about, what are all databases Sitecore uses. Sitecore uses multiple databases to manage both content and also analytics related data. Content DatabasesSitecore uses three databases to maintain content. It always supports MS SQL server, but in Sitecore latest version 8.2 also supports Oracle 12g. But Oracle is only supported in CMS only mode, not for xDB. Sitecore CMS uses the following three databases, Core: This database contains all settings related to Sitecore, ex: Sitecore User Interface (Content Editor, Experience Editor, etc.) configuration. Using this database, we can add any new application, or shortcut on Sitecore launch pad or desktop.This database also contains information about authentication and authorization, (Users &amp; roles) Master: This is content authoring database. All content authors mainly interact with this database, using either Content Editor or Experience Editor. It contains all versions of any content or assets. Web: This is also called live database. It contains all the live content, which is serving on the production website. When content author modifies any content, and publish it, content copied over to web database. Master database contains all versions of content, whereas web database only contains live version of content. Web database is subset of the Master database. When we log into Sitecore, by default it always displays content from Master database, but we can select the database to show the content from other databases, like as shown below, Collection Database (Mongo DB):As stated in Sitecore documentation, “In the Siteecore Experience Database (xDB), the Collection database is the central repository for storing contact, interaction, history &amp; automation data.”It uses MongoDB - a highly scalable document-based NoSQL database solution.Prior to Sitecore Version 7.5, all of analytics data used to get stored in Analytics database which was part of MS SQL server. tracking.live:The tracking.live database is used by two entities: Task Storage (defined in Sitecore.Analytics.Processing.config file) Live Processing Pool (defined in Sitecore.Analytics.Processing.Aggregation.ProcessingPools.config file)read more information on Sitecore stackexchange tracking.history:The tracking.history database is used by only one entity:History Processing Pool (defined in the Sitecore.Analytics.Processing.Aggregation.ProcessingPools.config file).read more information on Sitecore stackexchange tracking.contact:The tracking.contact database is used by only one entity:Contact Processing Pool (defined in the Sitecore.Analytics.Processing.Aggregation.ProcessingPools.config file).read more information on Sitecore stackexchange Reporting Database:The reporting database is a SQL Server database that stores aggregated data from the collection database suitable for fast querying and reporting. This database contains aggregated data from collection DB. Happy Learning :)","categories":[{"name":"Sitecore","slug":"Sitecore","permalink":"http://gopigujjula.com/categories/Sitecore/"},{"name":"Saturday Sitecore Learning","slug":"Sitecore/Saturday-Sitecore-Learning","permalink":"http://gopigujjula.com/categories/Sitecore/Saturday-Sitecore-Learning/"}],"tags":[{"name":"Sitecore","slug":"Sitecore","permalink":"http://gopigujjula.com/tags/Sitecore/"},{"name":"Beginner","slug":"Beginner","permalink":"http://gopigujjula.com/tags/Beginner/"},{"name":"Saturday Sitecore Learning","slug":"Saturday-Sitecore-Learning","permalink":"http://gopigujjula.com/tags/Saturday-Sitecore-Learning/"}]},{"title":"Saturday Sitecore Learning - Visual Studio - Project - Outside Web root","slug":"Saturday-Sitecore-Learning-Sitecore8.2-VS2015-Project-Outside-webroot","date":"2016-11-12T05:30:00.000Z","updated":"2017-02-26T11:03:21.262Z","comments":true,"path":"2016/11/Saturday-Sitecore-Learning-Sitecore8.2-VS2015-Project-Outside-webroot/","link":"","permalink":"http://gopigujjula.com/2016/11/Saturday-Sitecore-Learning-Sitecore8.2-VS2015-Project-Outside-webroot/","excerpt":"","text":"In recent post we had seen, how to set up project inside the web root. But this option is only useful for POC’s. Most of the time outside web root option is more useful. In this post let’s explore more advanced, I am using Visual Studio 2015 community/professional edition, and Sitecore 8.2. Outside web root setup steps: Open the Visual Studio, and navigate to File -&gt; New -&gt; Project, to create new project. Select the .NET Framework (in our case 4.5.2) version, and select the ASP.NET web application template. Enter the Name of the project, specify the Location field, and then click on OK to continue. Now we get another dialog, to select the project template. Here select Empty template present under ASP.NET 4.5.2 Templates section, and check the MVC checkbox as shown below, and click OK to proceed. Once the project is created, solution contains the files as shown below. Now from the project, remove Web.config, and Global.asax files, otherwise while publishing, these files will override the respective Sitecore files. Once after deleted, we need to copy both Web.config and Global.asax from web root into the project. Create a folder with name App_Config, then copy the ConnectionStrings.config &amp; Sitecore.config files from web root to the project. Next step is to add Sitecore references. We need both Sitecore.Kernel.dll &amp; Sitecore.MVC.dll, Let’s grab these files from web root. Create a directory in Project file system, let’s call that Assemblies, and copy the two dll’s to inside the directory. Please double check on the Mvc version compatibility here, and make sure you are using correct .NET Mvc version. We can verify the MVC version in Web.config file as shown below. Now our project is all set. To deploy we need to create a publishing profile. Select Publishing Method as File System and specify the local Sitecore instance web root path. At last, click on the Publish button, we can see the Site is published to web root folder. To confirm the publish to web root folder, we can navigate to bin folder in web root folder, and see that SIMSitecore.dll is copied over. Now try to load the site, and check whether we are able to login to Sitecore or not. That’s all, thanks for reading. Happy Learning :)","categories":[{"name":"Sitecore","slug":"Sitecore","permalink":"http://gopigujjula.com/categories/Sitecore/"},{"name":"Saturday Sitecore Learning","slug":"Sitecore/Saturday-Sitecore-Learning","permalink":"http://gopigujjula.com/categories/Sitecore/Saturday-Sitecore-Learning/"}],"tags":[{"name":"Sitecore","slug":"Sitecore","permalink":"http://gopigujjula.com/tags/Sitecore/"},{"name":"Beginner","slug":"Beginner","permalink":"http://gopigujjula.com/tags/Beginner/"},{"name":"Saturday Sitecore Learning","slug":"Saturday-Sitecore-Learning","permalink":"http://gopigujjula.com/tags/Saturday-Sitecore-Learning/"}]},{"title":"Saturday Sitecore Learning - Visual Studio - Project - Inside Web root","slug":"Saturday-Sitecore-Learning-Sitecore8.2-VS2015-Project-Inside-webroot","date":"2016-11-05T05:30:00.000Z","updated":"2017-02-26T11:03:21.227Z","comments":true,"path":"2016/11/Saturday-Sitecore-Learning-Sitecore8.2-VS2015-Project-Inside-webroot/","link":"","permalink":"http://gopigujjula.com/2016/11/Saturday-Sitecore-Learning-Sitecore8.2-VS2015-Project-Inside-webroot/","excerpt":"","text":"In this post we will look into creating Visual Studio project for the installed Sitecore. There are mainly two approaches to create the project, Inside the web rootHere both deployed files, and solution files in same location. Setting up is pretty straight forward, and good for small POC’s, but not recommended for real time projects. Outside the web rootThis is the most preferred one, as it separates the Sitecore, and our code and Sitecore in different locations, and easy to version Control. This is the recommended approach from core Sitecore team. In this post we will look into the first approach, I am using Visual Studio 2015 edition. Inside the web root Setup steps: Open the Visual Studio, and navigate to File -&gt; New -&gt; Project, to create new project. Select the .NET Framework (in our case 4.5.2) version, and select the ASP.NET web application template. Enter the Name of the project, and in Location field specify the newly installed Sitecore web root path (in our case F:\\inetpub\\wwwroot\\SIMSitecore\\Website), and make sure to uncheck the Create directory for solution checkbox, and then click on OK button. Now we get another dialog, to select the project template. Here select Empty template present under ASP.NET 4.5.2 Templates section, and check the MVC checkbox as shown below, and click OK to proceed. Once the project is created, solution contains the files/folders as shown below. If we go to the web root, we can observe there is a new folder created with the specified project name, and also new solution file (.sln) with the same name. Drill down the newly created folder (SIMSitecore), to see the files, which are same as shown in the VS solution explorer. Close the VS solution. Copy the Properties directory, SIMSitecore.csproj, and SIMSitecore.csproj.user files to the main web root directory. Now delete the SIMSitecore subdirectory, which is present inside the Website directory. Open the SIMSitecore.csproj file in Visual studio, and delete all the missing files from project. Add references to Sitecore.Kernel.dll &amp; Sitecore.MVC.dll files which are in Website-&gt;bin directory. Navigate to the Sitecore references To be continued -having some trouble to setup Happy Learning :)","categories":[{"name":"Sitecore","slug":"Sitecore","permalink":"http://gopigujjula.com/categories/Sitecore/"},{"name":"Saturday Sitecore Learning","slug":"Sitecore/Saturday-Sitecore-Learning","permalink":"http://gopigujjula.com/categories/Sitecore/Saturday-Sitecore-Learning/"}],"tags":[{"name":"Sitecore","slug":"Sitecore","permalink":"http://gopigujjula.com/tags/Sitecore/"},{"name":"Beginner","slug":"Beginner","permalink":"http://gopigujjula.com/tags/Beginner/"},{"name":"Saturday Sitecore Learning","slug":"Saturday-Sitecore-Learning","permalink":"http://gopigujjula.com/tags/Saturday-Sitecore-Learning/"}]},{"title":"Saturday Sitecore Learning - Launchpad","slug":"Saturday-Sitecore-Learning-Launchpad","date":"2016-10-29T05:30:00.000Z","updated":"2017-02-26T11:03:20.958Z","comments":true,"path":"2016/10/Saturday-Sitecore-Learning-Launchpad/","link":"","permalink":"http://gopigujjula.com/2016/10/Saturday-Sitecore-Learning-Launchpad/","excerpt":"","text":"By this time, we have latest version (8.2) of Sitecore running in local. It’s ok to install using either of the three approaches, web application installer, or manual installation, or using SIM. Before going ahead to create .NET web application, it’s good to have a look at Sitecore launch pad, different components, and the content tree structure. For any application, to open Sitecore, we need to append /sitecore to the URL. In my case, URL is http://testsitecore/, so to open Sitecore click on http://testsitecore/sitecore. To login to Sitecore, default Administrator credentials are as belowusername: adminpassword: b Once we login, we can see the Sitecore Launchpad, In the Launchpad, we can see there are 4 sections, Marketing Applications: This section contains, all the components relate to Digital Marketing suite. These are the main components using which marketers can connect better with customers. Content Editing: This section is the main heart of the CMS. Using these components, Content Authors can add, edit, or delete the content. Control Panel: As the name suggests, using these components, we can do the administrative activities, like Search indexing manager, clean up databases, and localization.. etc. Access Management: This section contains all the user, role, and security related components. Now we look into some of the main components, Content Editor: This is where Content Authors manage content. They can either add, edit, or delete the content. As a developer, we frequently access this to create templates, rendering, and placeholders etc. In this all items are displayed in tree structure. Experience Editor: Here Content Authors can create/modify the content in the live mode. In previous Sitecore versions this was called Page Editor. Experience Analytics: This section contains more of reports, like Channel groups by visits, Top campaigns by value, Top goals by conversions, etc. In the next post, we will look into how to create a .NET web project for Sitecore. Happy Learning :)","categories":[{"name":"Sitecore","slug":"Sitecore","permalink":"http://gopigujjula.com/categories/Sitecore/"},{"name":"Saturday Sitecore Learning","slug":"Sitecore/Saturday-Sitecore-Learning","permalink":"http://gopigujjula.com/categories/Sitecore/Saturday-Sitecore-Learning/"}],"tags":[{"name":"Sitecore","slug":"Sitecore","permalink":"http://gopigujjula.com/tags/Sitecore/"},{"name":"Beginner","slug":"Beginner","permalink":"http://gopigujjula.com/tags/Beginner/"},{"name":"Saturday Sitecore Learning","slug":"Saturday-Sitecore-Learning","permalink":"http://gopigujjula.com/tags/Saturday-Sitecore-Learning/"}]},{"title":"Saturday Sitecore Learning - Sitecore Installation with SIM tool","slug":"Saturday-Sitecore-Learning-Sitecore-Installation-Using-SIM","date":"2016-10-22T05:30:00.000Z","updated":"2017-07-30T07:17:43.525Z","comments":true,"path":"2016/10/Saturday-Sitecore-Learning-Sitecore-Installation-Using-SIM/","link":"","permalink":"http://gopigujjula.com/2016/10/Saturday-Sitecore-Learning-Sitecore-Installation-Using-SIM/","excerpt":"","text":"Saturday Sitecore Learning: Sitecore with SIMLast week, we had seen how to install Sitecore Instance Manager (SIM) tool. This week we will explore how to install Sitecore using SIM. Among all the three (Web Application Installer, Manual Installation, and SIM) available options, to choose, SIM is the most preferred choice among all the Sitecore developers. The Main reason for that is the flexibility it provides in managing the Sitecore sites. Let’s dive into step by step Sitecore installation, Step 1:If we remember in the last post, while installing SIM, we configured 4 settings, these are very crucial while installing Sitecore. Before proceeding any further, we need to double check on these settings, and if it is required, make any necessary changes. Instance Root Folder SQL Server Connection String Sitecore License File Local repository (Make sure to place downloaded Sitecore zip folder inside this path) To verify the 4 options, open the Home tab, and click on the Settings Step 2:For additional settings, click on Advanced Settings. But before making any changes, please go through the documentation very carefully. Step 3:Click on the Install Instance Step 4:Make all the necessary changes, Site Name, and Host name. Location value is prepopulated from the settings Instance Root Folder. Click on Next to proceed. Step 5:Some more options for instance details. Better to keep the default values, until and unless you are fully aware of the modifications. Click on Next to proceed. Step 6:If any of the Sitecore modules are present in the Instance Root Folder, those all are going to be listed here. We can select the modules, to install with Sitecore. Click on Next to proceed. Step 7:You can select any available custom packages, and click on Next to proceed. Step 8:Select any Configuration presets, and click on Next to proceed. Step 9:Finally all the selected modules, and custom packages, will be listed for review. Make any final modification and click on Install. Step 10:Now Sitecore is getting installed. Step 11:Once the installation is completed, you can check the listed options, and click on Finish. See you on next Saturday. Happy Learning :)","categories":[{"name":"Sitecore","slug":"Sitecore","permalink":"http://gopigujjula.com/categories/Sitecore/"},{"name":"Saturday Sitecore Learning","slug":"Sitecore/Saturday-Sitecore-Learning","permalink":"http://gopigujjula.com/categories/Sitecore/Saturday-Sitecore-Learning/"},{"name":"Installation","slug":"Sitecore/Saturday-Sitecore-Learning/Installation","permalink":"http://gopigujjula.com/categories/Sitecore/Saturday-Sitecore-Learning/Installation/"}],"tags":[{"name":"Sitecore","slug":"Sitecore","permalink":"http://gopigujjula.com/tags/Sitecore/"},{"name":"Beginner","slug":"Beginner","permalink":"http://gopigujjula.com/tags/Beginner/"},{"name":"Saturday Sitecore Learning","slug":"Saturday-Sitecore-Learning","permalink":"http://gopigujjula.com/tags/Saturday-Sitecore-Learning/"}]},{"title":"Saturday Sitecore Learning - Sitecore Instance Manager (SIM) ","slug":"Saturday-Sitecore-Learning-SIM-Installation","date":"2016-10-15T05:30:00.000Z","updated":"2017-02-26T11:03:21.078Z","comments":true,"path":"2016/10/Saturday-Sitecore-Learning-SIM-Installation/","link":"","permalink":"http://gopigujjula.com/2016/10/Saturday-Sitecore-Learning-SIM-Installation/","excerpt":"","text":"Saturday Sitecore Learning: SIM tool InstallationSitecore Instance Manager (SIM), is the tool, using which we can install, maintain, and uninstall the Sitecore. Among Sitecore developers, this is the most preferred choice to maintain Sitecore installations. SIM provides rich set of choices, you can watch this wonderful video, in which Vasiliy Fomichev explains the main features. In this post, we will look into SIM installation, in the next we will look into Sitecore installation using SIM. Installation Steps Download SIM tool from [Sitecore Marketplace] (https://marketplace.sitecore.net/en/Modules/Sitecore_Instance_Manager.aspx). Click on the Link to get the ClickOnce version of SIM. It will be redirected to http://dl.sitecore.net/updater/sim/. From here click on Install and Launch. Click on the downloaded SIM.Tool.application On the Initial Configuration Wizard, click on Next to proceed. Click on Next to proceed. In the previous post, we had downloaded latest Sitecore Zip (Sitecore 8.2 rev. 160729) file. For local repository point to the location of Sitecore folder, and point the local path for Sitecore License file. Here give a SQL connection string, with (Data Source, User ID and Password) values. Specify the File system path, and make sure to give the Network Service access, by clicking on the Grant button. After the successful installation, SIM will check for any sitecore websites in the specified File System path. In my local I already have TestSitecore website, the same is listed below. Happy Learning :)","categories":[{"name":"Sitecore","slug":"Sitecore","permalink":"http://gopigujjula.com/categories/Sitecore/"},{"name":"Saturday Sitecore Learning","slug":"Sitecore/Saturday-Sitecore-Learning","permalink":"http://gopigujjula.com/categories/Sitecore/Saturday-Sitecore-Learning/"}],"tags":[{"name":"Sitecore","slug":"Sitecore","permalink":"http://gopigujjula.com/tags/Sitecore/"},{"name":"Beginner","slug":"Beginner","permalink":"http://gopigujjula.com/tags/Beginner/"},{"name":"Saturday Sitecore Learning","slug":"Saturday-Sitecore-Learning","permalink":"http://gopigujjula.com/tags/Saturday-Sitecore-Learning/"}]},{"title":"Saturday Sitecore Learning - Manual Installation","slug":"Saturday-Sitecore-Learning-Manual-Installation","date":"2016-10-08T03:30:00.000Z","updated":"2017-07-30T07:14:32.251Z","comments":true,"path":"2016/10/Saturday-Sitecore-Learning-Manual-Installation/","link":"","permalink":"http://gopigujjula.com/2016/10/Saturday-Sitecore-Learning-Manual-Installation/","excerpt":"","text":"Saturday Sitecore Learning: Manual Installation: Installing from the .ZIP FileIn this post, we will look into Manual installation option. Installation Overview:Before proceeding, we need to understand what will happen in the installation process. In my previous post we discussed about installation using executable(.exe). There after giving all the information, and click on the install button, in the background it will perform the below operations, Creates 5 databases, like shown below, Copies Sitecore site in the specified destination folder path. Creates new website in IIS, and point to the destination folder. Takes care of the other details like updating the database information in ConnectionStrings.config file, folder securities, and other configurations. When we go through manual installation, we need to take care of all the above steps. Sitecore Manual Installation:I have downloaded latest Sitecore .ZIP file (Sitecore 8.2 rev. 160729) from dev.sitecore.net. Unzip the file, then we can see the three folders as shown below, copy all these three folders to destination folder. Now we will look into Database setup, Step 1: Open SQL Server Management Studio (SSMS) in Admin mode, Right click on Databases, and select Attach new databases. All the .mdf and .ldf files are present inside the Databases folder, which can be found in the unzipped folder. Attach all five databases. Step 2: Next step is to create new user. Navigate to Security –&gt;Login, and click on ‘New Login’, and map all the five databases, with db_owner role. Now all the databases are set. Next we will proceed to Website setup: Step 1: Copy your Sitecore license (license.xml) file under Data folder, and update the path in Website\\App_Config\\Sitecore.config file.1&lt;sc.variable name=&quot;dataFolder&quot; value=&quot;F:\\inetpub\\wwwroot\\Data&quot; /&gt; Step 2: Update the ConnectionStrings.config file, which is present in Website\\App_Config path. Step 3: Open IIS, and create new website, and make sure to add new host with site name. Now run the site, it will load the Sitecore default home page.In next post we will explore the Sitecore installation option using SIM. Happy Learning :)","categories":[{"name":"Sitecore","slug":"Sitecore","permalink":"http://gopigujjula.com/categories/Sitecore/"},{"name":"Saturday Sitecore Learning","slug":"Sitecore/Saturday-Sitecore-Learning","permalink":"http://gopigujjula.com/categories/Sitecore/Saturday-Sitecore-Learning/"},{"name":"Installation","slug":"Sitecore/Saturday-Sitecore-Learning/Installation","permalink":"http://gopigujjula.com/categories/Sitecore/Saturday-Sitecore-Learning/Installation/"}],"tags":[{"name":"Sitecore","slug":"Sitecore","permalink":"http://gopigujjula.com/tags/Sitecore/"},{"name":"Beginner","slug":"Beginner","permalink":"http://gopigujjula.com/tags/Beginner/"},{"name":"Saturday Sitecore Learning","slug":"Saturday-Sitecore-Learning","permalink":"http://gopigujjula.com/tags/Saturday-Sitecore-Learning/"}]},{"title":"Saturday Sitecore Learning - Sitecore Installation : Web Application Installer","slug":"Saturday-Sitecore-Learning-Web-Application-Installer","date":"2016-10-01T03:30:00.000Z","updated":"2017-07-30T07:14:30.155Z","comments":true,"path":"2016/10/Saturday-Sitecore-Learning-Web-Application-Installer/","link":"","permalink":"http://gopigujjula.com/2016/10/Saturday-Sitecore-Learning-Web-Application-Installer/","excerpt":"","text":"My Apologies. Due to some unavoidable reasons, I couldn’t add any posts in the last two months. Again I am re-initiating it from this month. In learning series, till now we have seen what is Sitecore, resources, and certification information. From now onwards, we will look into Initial Setup, installation, and implementation parts. Sitecore installation can be done in three ways Sitecore web application installer Sitecore Zip (manual installation) Sitecore Instance Manager (SIM) Sitecore installation consists of mainly three steps. DB Setup Web site Deploy location IIS configuration for site In this post, we will look into first option. Sitecore web application installer:Among all the three options, web application installer is the easiest one, as it is through exe. We just need to run .exe file and follow the instructions. Before installing Sitecore, we need to have following installed, with administrator access .NET framework 4.5 and above (for Sitecore 8.2) IIS Visual Studio - Community/Professional/Enterprise MS SQL Server or Oracle Mongo DB You can find more details here about Sitecore compatibility. Download latest Sitecore exe file -version (Sitecore 8.2 rev. 160729) from dev.sitecore.net. Installation StepsStep 1: Unzip the downloaded file, and run the Sitecore 8.2 rev. 160729.exe file, and click on Next -&gt;. Step 2: Accept the license agreement, and click on Next -&gt;. Step 3: Select the type of installation. Here we have three options, Complete: both Sitecore web site and database. Database Only: It is useful when we already have web site setup, but need fresh DB. Client Only: It is useful if we are using the database from any other common server with in the organization.If you are trying to install in personal mission then choose Complete option otherwise based on requirement choose the option and click on Next -&gt;. Step 4: Give a unique name for this new instance and click on Next -&gt;. Step 5: Select the Sitecore license file. I do not have much information on how to get the license file. I am using my firm (Sitecore Platinum Partner) license file. I guess for individual developer, there is a Student trail license which is valid for one month.Once license file is selected, it will auto populate the below details. Then click on Next -&gt;. Step 6: Both SQL Server and Oracle are supported. Select the database vendor from dropdown, give the Database server name, and credentials. On click of Advanced settings, we can change Database Prefix, which will be defaulted to previously given Sitecore instance name. Imp Note: Login Id should have admin access enabled in DB server.Click on OK to proceed. Step 7: Select the IIS root path/wwwroot folder location for Sitecore installation. From Advanced settings, can also select locations for Data, and Database. Click on Next -&gt; to proceed. Step 8: Give web site name, and click on Next -&gt; to proceed. Step 9: At last one more time review all the options, and click Install. Step 10: Sitecore will take some time to get installed, and after finishing the installation, select the Launch Sitecore check box, and click on Finish. Step 11: Now, you can see Sitecore home page in your default browser. You can login with default Sitecore credentials,User name: adminPassword: b Cheers on successful installation.In my next post I will explain about Manual Installation. Happy Learning :)","categories":[{"name":"Sitecore","slug":"Sitecore","permalink":"http://gopigujjula.com/categories/Sitecore/"},{"name":"Saturday Sitecore Learning","slug":"Sitecore/Saturday-Sitecore-Learning","permalink":"http://gopigujjula.com/categories/Sitecore/Saturday-Sitecore-Learning/"},{"name":"Installation","slug":"Sitecore/Saturday-Sitecore-Learning/Installation","permalink":"http://gopigujjula.com/categories/Sitecore/Saturday-Sitecore-Learning/Installation/"}],"tags":[{"name":"Sitecore","slug":"Sitecore","permalink":"http://gopigujjula.com/tags/Sitecore/"},{"name":"Beginner","slug":"Beginner","permalink":"http://gopigujjula.com/tags/Beginner/"},{"name":"Saturday Sitecore Learning","slug":"Saturday-Sitecore-Learning","permalink":"http://gopigujjula.com/tags/Saturday-Sitecore-Learning/"}]},{"title":"My Journey from Hotel Management student to Software Engineer","slug":"My-Journey-from-Hotel-Management-student-to-Software-Engineer","date":"2016-07-03T04:30:00.000Z","updated":"2016-09-17T19:49:54.634Z","comments":true,"path":"2016/07/My-Journey-from-Hotel-Management-student-to-Software-Engineer/","link":"","permalink":"http://gopigujjula.com/2016/07/My-Journey-from-Hotel-Management-student-to-Software-Engineer/","excerpt":"","text":"Every journey has to start some where, I am going to start mine from my graduation. Why am I telling this now? As, I am celebrating my 6th year (1st July) work anniversary, want to go back to where i had started. Currently I am working as a Senior Engineer in an IT firm at Bangalore. I am a hotel management graduate(also a chemistry graduate), then went on to do a masters in computer science and later became a software engineer. Please read the full post here","categories":[],"tags":[{"name":"Career","slug":"Career","permalink":"http://gopigujjula.com/tags/Career/"}]},{"title":"Saturday Sitecore Learning : Developer Resources","slug":"Saturday-Sitecore-Learning-Developer-Resources","date":"2016-07-02T03:30:00.000Z","updated":"2017-02-26T11:03:20.916Z","comments":true,"path":"2016/07/Saturday-Sitecore-Learning-Developer-Resources/","link":"","permalink":"http://gopigujjula.com/2016/07/Saturday-Sitecore-Learning-Developer-Resources/","excerpt":"","text":"Now we explore what are all the resources available for developers to learn Sitecore. Prerequisite : As we know that, it is built on .NET platform, so we should have basic understanding, and little hands-on experience in .NET, ASP.NET (Web Forms or MVC), C#, and little bit in SQL server or RDBMS concepts. Sitecore company is providing two options to train backend developers, although course curriculum is similar in both, Classroom Training:Duration: 4 daysFees: varies country to country, but approximately around USD $2000+.Lectures by: Sitecore Certified TrainersHands on lab: YesCertification: I do not have much information on this.Sitecore License: Not sure about this.More details: Check here eLearningDuration: 14 hoursFees: USD $1500.Lectures by: Pre recorded videos by TrainersHands on lab: YesCertification: The purchase of this course includes a Sitecore Certification Exam Voucher (for single attempt).Sitecore License: Sitecore license is must to practice labs. Independent developers may apply for a one month Temporary Student License.Course Access: Up to 4 months.More details: Check here I have taken eLearning course, which was fully sponsored by my company Verndale. Course is having very good explanation of the concepts, and after the course completion, passed the Certification exam, and got the Sitecore 8 Professional Developer Certification. One main drawback of the course is, it is based on ASP .NET Web Forms. But mostly all new projects are into ASP.NET MVC implementation. But anyway Sitecore concepts are more of similar in both. Other optionsIf you are unable to spend that much amount on course, and if your company is not sponsoring it, then it is little bit difficult to kick start. But there are so many wonderful people who share their knowledge through blog posts, webinars, and videos.There is a very good community around Sitecore, with lot of MVPs and certified developers. Developer Portal: dev.sitecore.netCommunity documentation: sitecore-community.github.io/docs/Slack Channel: sitecorechatUnofficial Sitecore 8 Training Webinar Series: http://www.akshaysura.com/2016/02/03/unofficial-sitecore-8-training-webinar-series-full-curriculum/Stack Exchange: sitecore.stackexchange.com Happy Learning :)","categories":[{"name":"Sitecore","slug":"Sitecore","permalink":"http://gopigujjula.com/categories/Sitecore/"},{"name":"Saturday Sitecore Learning","slug":"Sitecore/Saturday-Sitecore-Learning","permalink":"http://gopigujjula.com/categories/Sitecore/Saturday-Sitecore-Learning/"}],"tags":[{"name":"Sitecore","slug":"Sitecore","permalink":"http://gopigujjula.com/tags/Sitecore/"},{"name":"Beginner","slug":"Beginner","permalink":"http://gopigujjula.com/tags/Beginner/"},{"name":"Saturday Sitecore Learning","slug":"Saturday-Sitecore-Learning","permalink":"http://gopigujjula.com/tags/Saturday-Sitecore-Learning/"}]},{"title":"Saturday Sitecore Learning - About Sitecore","slug":"Saturday-Sitecore-Learning-About-Sitecore","date":"2016-06-25T07:30:00.000Z","updated":"2017-02-26T11:03:20.833Z","comments":true,"path":"2016/06/Saturday-Sitecore-Learning-About-Sitecore/","link":"","permalink":"http://gopigujjula.com/2016/06/Saturday-Sitecore-Learning-About-Sitecore/","excerpt":"","text":"After learning about WCM platforms, now I am trying to understand more about Sitecore as a technology and as well as product, and it’s market position.As a developer, it is very much crucial to know that, when we choose it as a career path/option, and to make sure we are investing our time on technologies which are having bright future. After going through several websites and posts, here is my notes, For seven years in a row, the Sitecore Experience Platform has been placed in the Leaders quadrant of Gartner’s Magic Quadrant for Web Content Management. In ranking Sitecore as a leader In CMS, Gartner cited the company’s strengths as: Sitecore has an industry-leading, compelling and executable vision for a “contextual delivery machine.” The Sitecore Experience Database (xDB), which promises to deliver the long-sought-after “360-degree view of the customer,” contributes to this vision. Sitecore is one of the leading enterprise-level Content Management System in .NET world, using which we can create both Intranet portals and enterprise web sites. It supports ASP.NET MVC and as well as Web Forms. Sitecore company was started in Copenhagen in 2001 by five friends who saw a need for a better way to build and manage websites. Sitecore product was mainly introduced as WCM platform, which combines the components dynamically on to page and deliver to the user. Later on it has evolved to fully digital marketing platform, and now it is called as Sitecore Experience Platform, which included Web Content Management, Customer Intelligence, and Cross-Channel Delivery. Sitecore is mainly trying to achieve, “To deliver the right content to the right person at the right time and on the right device.“ Below pic depicts, what exactly Sitecore Experience Platform provides, Please check this link to know more about the experience platform. “Sitecore is a high-performance, scalable, extensible ASP.NET web CMS that generates all outputdynamically and uses the same components and system architecture for both content and applicationpages.” – John West (All time Sitecore MVP) Current version of Sitecore is 8.2, which is going to be released on August - 2016. Sitecore continuously and very rapidly evolves as a product, to provide more options and features to the customers. It provides a variety of licensing option to clients. Sitecore code is not open source. There is a very good article 8 Reasons Why Many Enterprise CMOs Choose Sitecore Credits:SitecorePerficient Happy Learning :)","categories":[{"name":"Sitecore","slug":"Sitecore","permalink":"http://gopigujjula.com/categories/Sitecore/"},{"name":"Saturday Sitecore Learning","slug":"Sitecore/Saturday-Sitecore-Learning","permalink":"http://gopigujjula.com/categories/Sitecore/Saturday-Sitecore-Learning/"}],"tags":[{"name":"Sitecore","slug":"Sitecore","permalink":"http://gopigujjula.com/tags/Sitecore/"},{"name":"Beginner","slug":"Beginner","permalink":"http://gopigujjula.com/tags/Beginner/"},{"name":"Saturday Sitecore Learning","slug":"Saturday-Sitecore-Learning","permalink":"http://gopigujjula.com/tags/Saturday-Sitecore-Learning/"}]},{"title":"Saturday Sitecore Learning - Content Management System","slug":"Saturday-Sitecore-Learning-CMS","date":"2016-06-18T07:30:00.000Z","updated":"2017-02-26T11:03:20.861Z","comments":true,"path":"2016/06/Saturday-Sitecore-Learning-CMS/","link":"","permalink":"http://gopigujjula.com/2016/06/Saturday-Sitecore-Learning-CMS/","excerpt":"","text":"In this post we mainly discuss about what is CMS (Content Management System) or sometimes called WCMS. When I think of any tool or technology, first thing that comes to my mind is, under which category it falls into, and what are the benefits of using it. for example, when we say C#, what is it? C# is a programming Language, same as c, or C++. (I am not getting into the details of OOP language or functional language), when we say Entity Framework or Hibernate, these are Object Relational Mapping tools, and MS SQL Server is RDBMS, similar way Sitecore is one of the enterprise-level Content Management System (CMS) platform. So what exactly CMS means?I found one of the definitions in Lynda site, which I feel very apt, “Server-side software that is designed to simplify the creation and maintenance of sites. These systems manage online content, generate web pages, and allow users to upload and change content without requiring technical expertise” – Lynda.com For normal websites, if client needs to add or modify any content (page, text, image or video), they cannot make this changes directly, first they need to reach out to technical team (Web Developer), with their help they can make the required changes. But this is time consuming process, and definitely not feasible for the rapidly content changing site. In this cases, clients need a way to update their content as quickly as possible. Content Management Systems help client in this process. CMS provides a way to streamline the content addition, approval, and publishing. CMS provides an easy UI to create or modify the content. There are lot of Content Management Systems for each technology (PHP,.NET, and Java etc). Some of the popular CMS among all technologies, Wordpress Joomla Drupal Popular CMS in .NET, DotNetNuke Sitecore Umbraco EpiServer Kentico Sitefinity mojoPortal Credits : Image Courtesy Happy Learning :)","categories":[{"name":"Sitecore","slug":"Sitecore","permalink":"http://gopigujjula.com/categories/Sitecore/"},{"name":"Saturday Sitecore Learning","slug":"Sitecore/Saturday-Sitecore-Learning","permalink":"http://gopigujjula.com/categories/Sitecore/Saturday-Sitecore-Learning/"}],"tags":[{"name":"Sitecore","slug":"Sitecore","permalink":"http://gopigujjula.com/tags/Sitecore/"},{"name":"Beginner","slug":"Beginner","permalink":"http://gopigujjula.com/tags/Beginner/"},{"name":"Saturday Sitecore Learning","slug":"Saturday-Sitecore-Learning","permalink":"http://gopigujjula.com/tags/Saturday-Sitecore-Learning/"}]},{"title":"Career Awards","slug":"career-awards","date":"2016-06-12T04:30:00.000Z","updated":"2016-09-17T20:07:16.126Z","comments":true,"path":"2016/06/career-awards/","link":"","permalink":"http://gopigujjula.com/2016/06/career-awards/","excerpt":"","text":"2015 - Spot Award at 𝐍𝐓𝐓𝐃𝐚𝐭𝐚,2016 - VET Award at 𝐕𝐞𝐫𝐧𝐝𝐚𝐥𝐞…","categories":[],"tags":[{"name":"Career","slug":"Career","permalink":"http://gopigujjula.com/tags/Career/"}]},{"title":"Saturday Sitecore Learning - Introduction","slug":"Saturday-Sitecore-Learning-Series","date":"2016-06-11T16:00:00.000Z","updated":"2017-02-26T11:03:21.051Z","comments":true,"path":"2016/06/Saturday-Sitecore-Learning-Series/","link":"","permalink":"http://gopigujjula.com/2016/06/Saturday-Sitecore-Learning-Series/","excerpt":"","text":"It has been since few months, I had started learning Sitecore. In Sitecore, there are lot of concepts to learn, &amp; practice, and I have come across some wonderful videos, articles, and blogs, which explains the concepts very nicely. As I was learning, wanted to take notes, so that it will aid me in better understanding the concepts. The same notes I want to share it here.One of the video series I love on Sitecore is Weekly Friday video series covering Sitecore Best Practices by Vasiliy Fomichev a Sitecore MVP.I like his idea of one video on every Friday. With his inspiration, I have named this series as Saturday Sitecore Learning. Here every Saturday I will be posting one article on my learning. It will be kind of notes. Before started learning Sitecore, I have more than 5 years of experience in Web development, mainly using ASP.NET web forms and MVC, but never heard of neither CMS platform nor Sitecore term. At last why Sitecore? This is the easy one to answer, because in the organization where I work, we develop mostly digital marketing solutions, and we use Sitecore more. In the next post, let’s see what exactly is CMS platform, and why do we need one? Happy Learning :)","categories":[{"name":"Sitecore","slug":"Sitecore","permalink":"http://gopigujjula.com/categories/Sitecore/"},{"name":"Saturday Sitecore Learning","slug":"Sitecore/Saturday-Sitecore-Learning","permalink":"http://gopigujjula.com/categories/Sitecore/Saturday-Sitecore-Learning/"}],"tags":[{"name":"Sitecore","slug":"Sitecore","permalink":"http://gopigujjula.com/tags/Sitecore/"},{"name":"Beginner","slug":"Beginner","permalink":"http://gopigujjula.com/tags/Beginner/"},{"name":"Saturday Sitecore Learning","slug":"Saturday-Sitecore-Learning","permalink":"http://gopigujjula.com/tags/Saturday-Sitecore-Learning/"}]},{"title":"ASafaWeb - Automated Security Analyzer for ASP.NET Websites","slug":"asp-net-security-analyser","date":"2016-05-21T17:14:00.000Z","updated":"2016-11-05T11:55:13.660Z","comments":true,"path":"2016/05/asp-net-security-analyser/","link":"","permalink":"http://gopigujjula.com/2016/05/asp-net-security-analyser/","excerpt":"","text":"ASafaWebRecently I am trying to improve my knowledge on both general security and web security concepts. I was going through technical articles, blogs, and pluralsight courses. Also started attending the monthly OWASP tech meetup, where they mainly discuss on the security concepts and related technologies. In Pluralsight, there are lot of security courses authored by Troy Hunt, where he clearly explains the concepts in a simple manner. Even in his blog, there are wonderful articles. I learned a lot from his courses and articles. This ASafaWeb, is the tool developed by Troy Hunt, for specifically analyzing the ASP.NET websites for any security risks. This tool can analyze the vulnerabilities of the hosted site, and also it doesn’t require any access to the code. It mainly send some extra HTTP requests to the given site URL, and give us the report by analyzing the responses. The security check is mainly done for the following, Tracing Custom Errors Stack Trace Request Validation HTTP to HTTPS redirect Hash DoS patch ELMAH log Excessive Headers HTTP only cookies Secure cookies Clickjacking View state MAC ASafaWeb only checks for the common configuration related vulnerabilities, but there are many other security related aspects, like SQL injection, Cross Site Scripting, and Cross-Site Request Forgery, etc.. So for what are we waiting, just go to ASafaWeb, and enter your ASP.NET website URL, and click on Scan to get the report. We can also Schedule the scans, but we need to register for that. Currently it is in Beta stage.","categories":[{"name":"ASP.NET","slug":"ASP-NET","permalink":"http://gopigujjula.com/categories/ASP-NET/"}],"tags":[{"name":"ASP.NET","slug":"ASP-NET","permalink":"http://gopigujjula.com/tags/ASP-NET/"},{"name":"Tools","slug":"Tools","permalink":"http://gopigujjula.com/tags/Tools/"},{"name":"Security","slug":"Security","permalink":"http://gopigujjula.com/tags/Security/"}]},{"title":"ASP.NET Core day - BDotnet","slug":"aspnetcoreday","date":"2016-05-09T10:37:28.000Z","updated":"2017-02-26T10:57:23.446Z","comments":true,"path":"2016/05/aspnetcoreday/","link":"","permalink":"http://gopigujjula.com/2016/05/aspnetcoreday/","excerpt":"","text":"Another month, another BDotent community event, but this time it is on latest ASP.NET Core technology and a full day event. We are not going to miss it. :) For me all the BDotent events are about getting to know the gist of the topic and leave with enough enthusiasm to explore the remaining details. One more big thing is Networking, It is always pleasure to meet and know the fellow developers and to share the information on what type of applications we work on, and what all the tools &amp; technologies we are using.(This time met some of the old buddies, and also made some new friends.) Overall, it’s mainly the experience of being present at the event. As usual, all the speakers are wonderful in sharing their knowledge, and their enthusiasm conveys us the most. All the topics are very well chosen, like connecting the dots to get the overall picture on the ASP.NET core. Thank you for all the awesome speakers, and the organizing committee. It was wonderful to witness the house packed sessions. My key takeaways from the event are, As there is an another new framework is out, we shouldn’t jump in and start using it for all kind of applications. We first need to understand our application use cases, then evaluate the options to take the decision. ASP.NET (Web forms) framework is not going any where. It is very much supported. New features will still be coming out for this. There are lot of application, which are running on ASP.NET framework. (I had a big doubt on the ASP.NET web forms support, glad that it is clarified.) ASP.NET Web forms is not supported in ASP.NET core. It is very much dependent on System.Web. POCO controller are very much useful when we do not require all the features from BaseController. In new framework, Dependency Injection is already integrated, But if require, we can very much plug in any of the third party DI containers. New web server (Kestrel - cross platform) written from the scratch, for the .NET core. RC2 is going to be out in mid May, and RTM is going to be released by June end. Cloud born applications. Tag helpers, more cleanness, more readability. ASP.NET core more of modularized, empty project means it’s clearly empty. Whatever we want, we need to add it. Volunteer : It was my pleasure to help the event in a very small way (being part of the registration process). Thanks Lohith for the opportunity. some pics, Happy Learning :)","categories":[{"name":"ASP.NET","slug":"ASP-NET","permalink":"http://gopigujjula.com/categories/ASP-NET/"}],"tags":[{"name":"ASP.NET","slug":"ASP-NET","permalink":"http://gopigujjula.com/tags/ASP-NET/"},{"name":"Bangalore Tech event","slug":"Bangalore-Tech-event","permalink":"http://gopigujjula.com/tags/Bangalore-Tech-event/"},{"name":"Dotnet User Group","slug":"Dotnet-User-Group","permalink":"http://gopigujjula.com/tags/Dotnet-User-Group/"},{"name":"User Group","slug":"User-Group","permalink":"http://gopigujjula.com/tags/User-Group/"}]},{"title":"Agent Ransack - Free File Searching Utility","slug":"Agent-Ransact-tool","date":"2016-04-30T10:37:28.000Z","updated":"2017-02-26T11:07:02.669Z","comments":true,"path":"2016/04/Agent-Ransact-tool/","link":"","permalink":"http://gopigujjula.com/2016/04/Agent-Ransact-tool/","excerpt":"","text":"Agent RansackEverybody knows about, how painful to search for files in Windows, and also there is no easy way to search the content of all the files with particular text. Agent Ransack comes to our rescue, this is a very powerful file searching tool, which provides us lot of options to search the content, and generate reports. We can also search the remote server contents from our local, this is the most useful feature for me, which helps &amp; saves me lot of time. There are lot of options, like searching with regular expressions, date modified range, and match case etc. We can export the results to Tabular, CSV, or text formats. There is also a licensed version with more features File Locator Pro. We have also some other search utilities like Everything, and SearchMyFiles, but among all Agent Ransack stand out. There is a very nice article which explains the details about different search utilities. Credits : Thanks to Peter Franceschini, for letting me know about this wonderful tool.","categories":[],"tags":[{"name":"Tools","slug":"Tools","permalink":"http://gopigujjula.com/tags/Tools/"}]},{"title":"Dotnet Bangalore Q1-2016","slug":"DoteNet-Bangalore-meetup-Q1-2016","date":"2016-02-28T11:38:00.000Z","updated":"2017-02-26T11:03:20.395Z","comments":true,"path":"2016/02/DoteNet-Bangalore-meetup-Q1-2016/","link":"","permalink":"http://gopigujjula.com/2016/02/DoteNet-Bangalore-meetup-Q1-2016/","excerpt":"","text":"Dotnet Bangalore User Group (27-02-2016)This is one of the active dotnet user group in Bangalore. This event is conducted quarterly once on Saturday &amp; sponsored by Prowareness Bangalore. In this event speakers usually present on the .NET related topics. Around one year back that first I heard about this user group. Every time I plan to attend, but at the last minute, had to cancel because of some or other urgent work. This time I was very determined to attend it, glad that at last I could make it. This event happens at Prowareness office, Embassy TechVillage, &amp; a full day event. Following are the list of talks happened on 2016 Q1 meetup, What’s New in EF 7, by Raghavendra RentalaRaghavendra is having very good knowledge on Entity Framework, he explained some of the new concepts introduced in EF 7, with on hands demo. This talk was very informative. Techniques to optimize .NET Apps Performance Anand DeshmukhThis talk was completely on how to write better code in .NET, by keeping the performance in mind. This was also hands on. Common Intermediate Language (CIL) by Example Ganesh SGThis was the talk of the day. With his talk, Ganesh has taken us back to College days, where we used to struggle with Finite Automata. He explained how to learn &amp; practice on reading the Intermediate language, and all what are all the benefits we can get from that. Inheritance Concepts With Database Table, by Madhukar BhandariMadhukar clearly explained the Table per type(TPT), Table per hierarchy (TPH), and Table per concrete type(TPC) concepts in Database. This was also hands on demo. Dependency Injection with Ninject Mahesh PratapThis event in happened at the time of open house. Mahesh neatly explained the basics of Dependency injection, and how to implement DI concept using Ninject DI container in both desktop &amp; web application. Few other things about the event, Event is free of cost. Lunch, snacks, Tea, &amp; juice are provided by the sponsors. After the lunch, there was a technical quiz. Participants were divided into 3 groups, and believe me this Quiz was lot of fun. For winning team there was prizes too. At end of the event, there was a lucky draw on the submitted feedback forms. Some of the pics from facebook group page, Looking for Q2 meetup. Happy Learning :)","categories":[],"tags":[{"name":"Bangalore Tech event","slug":"Bangalore-Tech-event","permalink":"http://gopigujjula.com/tags/Bangalore-Tech-event/"},{"name":"Dotnet User Group","slug":"Dotnet-User-Group","permalink":"http://gopigujjula.com/tags/Dotnet-User-Group/"},{"name":"User Group","slug":"User-Group","permalink":"http://gopigujjula.com/tags/User-Group/"}]},{"title":"Sitecore Certification","slug":"sitecore-certification","date":"2016-02-16T09:59:16.000Z","updated":"2017-02-26T11:06:07.073Z","comments":true,"path":"2016/02/sitecore-certification/","link":"","permalink":"http://gopigujjula.com/2016/02/sitecore-certification/","excerpt":"","text":"Cleared Sitecore CertificationToday morning I have cleared Sitecore® XP 8 Website Development for .NET Developers Certification with 90% score. This is my first ever technical Certification. :) Happy Learning :)","categories":[{"name":"Sitecore","slug":"Sitecore","permalink":"http://gopigujjula.com/categories/Sitecore/"}],"tags":[{"name":"Sitecore","slug":"Sitecore","permalink":"http://gopigujjula.com/tags/Sitecore/"},{"name":"Certification","slug":"Certification","permalink":"http://gopigujjula.com/tags/Certification/"}]},{"title":"Static Blog Setup with Hexo : Hosting","slug":"static-blog-with-hexo-3","date":"2016-02-06T15:10:45.000Z","updated":"2017-02-26T11:06:06.851Z","comments":true,"path":"2016/02/static-blog-with-hexo-3/","link":"","permalink":"http://gopigujjula.com/2016/02/static-blog-with-hexo-3/","excerpt":"","text":"This blog is created using one of the Static blogging framework Hexo, and hosted using Github pages. This post is part-3 of the series and you can view all the posts in the series here Static Blog Setup with Hexo, and Github Project Setup in GithubTo host simple static HTML site, there are lot of options available. We can deploy them on normal hosting server or on cloud (like Amazon Web Services or Microsoft Azure). I have chosen Github pages to host my site.The main reason is, I can directly host my site from Github repository. For each Account, Github provides an option to host one static website. To create the repository and host the site, we have step by step instruction on the homepage. I am using Github Desktop as my Git client.By default this hosting files can be accessed from the URL http://username.github.io. Username being the account username. Custom domain setupI have my own domain which is purchased from Godaddy. In DNS provider (in my case Godaddy), first we need to create two ‘A’ records that point our custom domain to the following IP addresses:192.30.252.153192.30.252.154 In Github pages, we can setup our custom domain using the instructions. Credits : Thanks to Chitrang Shah, for letting us know about this wonderful framework Hexo. Happy Learning :)","categories":[{"name":"Hexo","slug":"Hexo","permalink":"http://gopigujjula.com/categories/Hexo/"}],"tags":[{"name":"hexo blog setup","slug":"hexo-blog-setup","permalink":"http://gopigujjula.com/tags/hexo-blog-setup/"}]},{"title":"Static Blog Setup with Hexo : Initial Setup","slug":"static-blog-with-hexo-2","date":"2016-01-28T07:15:28.000Z","updated":"2017-02-26T11:06:06.824Z","comments":true,"path":"2016/01/static-blog-with-hexo-2/","link":"","permalink":"http://gopigujjula.com/2016/01/static-blog-with-hexo-2/","excerpt":"","text":"This blog is created using one of the Static blogging framework Hexo, and hosted using Github pages. This post is part-2 of the series and you can view all the posts in the series here Static Blog Setup with Hexo, and Github Hexo InstallationHexo is powered by node.js framework. To Install Hexo, first we need to install Node.Js. It can be downloaded from here. We can verify the installation by checking the node version through command prompt. 1C:\\&gt;node --version Once Node.js is successfully installed, we can proceed with Hexo installation using the Node Package Manager.1C:\\&gt;npm install hexo -g Once the Hexo is installed, we need to setup website folder, 1C:\\&gt;hexo init [folder] [folder] is optional in the above command, if it is not specified folder structure will be created under the current directory, else in the specified directory. Website uses the default theme called “Landscape” from Hexo, To preview the site locally, we need to run the following command, 1E:\\Hexo Project&gt;hexo server [folder] now, we can preview the blog at http://localhost:4000, This finishes the hexo initial setup, in the next post will see how to host it in using Github pages.Please feel free to contact if you face any issues while setting up. Thanks for reading, and have a nice day :). Credits : Thanks to Chitrang Shah, for letting us know about this wonderful framework Hexo. Happy Learning :)","categories":[{"name":"Hexo","slug":"Hexo","permalink":"http://gopigujjula.com/categories/Hexo/"}],"tags":[{"name":"hexo blog setup","slug":"hexo-blog-setup","permalink":"http://gopigujjula.com/tags/hexo-blog-setup/"}]},{"title":"Static Blog Setup with Hexo : Introduction","slug":"static-blog-with-hexo-1","date":"2016-01-21T10:30:28.000Z","updated":"2017-02-26T11:06:06.796Z","comments":true,"path":"2016/01/static-blog-with-hexo-1/","link":"","permalink":"http://gopigujjula.com/2016/01/static-blog-with-hexo-1/","excerpt":"","text":"This blog is created using one of the Static blogging framework Hexo, and hosted using Github pages. This post is part-1 of the series and you can view all the posts in the series here Static Blog Setup with Hexo, and Github Static Site GeneratorEverybody knows about Wordpress which is a very famous CMS (Content Management System) blogging platform.Suppose we have a blog which is created using wordpress, in which we are trying to access a page. When a user tries to access a page using URL, what really happens behind the scene is, server will go &amp; fetch the content from one or more databases, template engine will process the content, and generate a HTML file which will sent to the client browser. In opposite way static site generators will take the content and layouts, once compiled it give us the HTML files which we can directly deploy on the server. When a user tries to access a page using URL, there is no processing involved, server just sends the corresponding HTML file. The big &amp; main difference which we can directly identify here is Speed which static site generator provides. This is main reason for which I had decided to use Static blogging Framework. There are lot of pros and cons in both the frameworks. You can find more details in this great article, and the following link contains the list of top Open-Source Static Site Generators . Tools &amp; Technologies I have used to create this blog Blogging Platform : Hexo Domain Registrar : GoDaddy Hosting Server : Github pages Version Control : Github Text Editor : Atom Comment System : Disqus Theme : icarus In upcoming posts in this series, I will show how I setup and configured to create this blog. Credits : Thanks to Chitrang Shah, for letting us know about this wonderful framework Hexo. Happy Learning :)","categories":[{"name":"Hexo","slug":"Hexo","permalink":"http://gopigujjula.com/categories/Hexo/"}],"tags":[{"name":"hexo blog setup","slug":"hexo-blog-setup","permalink":"http://gopigujjula.com/tags/hexo-blog-setup/"}]},{"title":"First Post","slug":"first-post","date":"2016-01-02T10:30:28.000Z","updated":"2017-02-26T11:20:58.524Z","comments":true,"path":"2016/01/first-post/","link":"","permalink":"http://gopigujjula.com/2016/01/first-post/","excerpt":"","text":"Hi, welcome to my blog, this is the first post. This blog is created using ‘Static Site Generator tool’ Hexo! I will be writing both technical and non-technical topics here. Technical posts will be in English, other writings will be either in English or Telugu (Mother tongue). Happy Learning :)","categories":[],"tags":[]},{"title":"Using statement in C#","slug":"Using-statement-in-C","date":"2015-06-03T14:27:00.000Z","updated":"2017-02-26T11:06:06.939Z","comments":true,"path":"2015/06/Using-statement-in-C/","link":"","permalink":"http://gopigujjula.com/2015/06/Using-statement-in-C/","excerpt":"","text":"Note : This post is first published on June-2015 in my previous blog Techkindle. Moving the content to here. using Using block/statement is used to free unmanaged resources. Using statement is translated to three parts, Acquisition Usage Disposal This resource is first acquired, then the usage is enclosed in a try statement with a finally clause. The object then gets disposed in the finally clause. 1234using (MemoryStream objStream = new MemoryStream())&#123; objStream.WriteTo(Response.OutputStream);&#125; this code gets translated to 12345678910MemoryStream objStream = new MemoryStream();try&#123; objStream.WriteTo(Response.OutputStream);&#125;finally&#123; if(objStream !=null) ((IDisposable)objStream).Dispose();&#125; Objects that implement IDisposable can be used in a using statement. Calling Dispose() explicitly (or implicitly via a using statement) can have performance benefits. “Code that is using a resource can call Dispose() to indicate that the resource is no longer needed. If Dispose() is not called, then automatic disposal eventually occurs as a consequence of garbage collection.” - MSDN In the below code we can observe the following points, If we use ‘using’ block along a Customer type, it give a compiler error, saying that “type used in a using statement must be implicitly convertible to ‘System.IDisposable’”. Same if use with Student type, it does not give any error, because it implements System.IDisposable interface. Sample code Happy Coding :)","categories":[{"name":"C#","slug":"C","permalink":"http://gopigujjula.com/categories/C/"}],"tags":[{"name":"C#","slug":"C","permalink":"http://gopigujjula.com/tags/C/"}]},{"title":"foreach loop in C#","slug":"foreach-loop-in-Csharp","date":"2015-06-03T13:25:00.000Z","updated":"2017-02-26T10:59:54.415Z","comments":true,"path":"2015/06/foreach-loop-in-Csharp/","link":"","permalink":"http://gopigujjula.com/2015/06/foreach-loop-in-Csharp/","excerpt":"","text":"Note : This post is first published on June-2015 in my previous blog Techkindle. Moving the content to here. foreach:It repeats a group of embedded statements for each element in an array or an object collection. By a collection, we mean any class, struct, or interface that implements the IEnumerable interface.foreach gives read-only access to the array contents, so we can not change the values of any of the elements.Only forward iteration is possible in for-each loop.The condition to work with IEnumerable objects is that the underlying collection must not change while you are accessing it. You can presume that the Enumerable object is a snap shot of the original collection, so if you tries to change the collection while enumerating, it will throw an exception. However the fetched objects in Enumeration is not immutable at all.Since the variable used in foreach loop is local to the loop block this variable is however not available outside the block. In the below code we can observe the following points, If we try to modify the foreach iteration variable either primitive type (int) or a user defined class (Customer), we get compile time error. If we try to add/remove any item from the collection, we get run time exception. We can always modify the object properties(Name property in Customer type), which are not immutable. Sample Code Happy Coding :)","categories":[{"name":"C#","slug":"C","permalink":"http://gopigujjula.com/categories/C/"}],"tags":[{"name":"C#","slug":"C","permalink":"http://gopigujjula.com/tags/C/"}]},{"title":"My first end to end (MVC) project","slug":"My-first-end-to-end-MVC-project","date":"2015-03-08T12:43:00.000Z","updated":"2017-02-26T11:09:49.490Z","comments":true,"path":"2015/03/My-first-end-to-end-MVC-project/","link":"","permalink":"http://gopigujjula.com/2015/03/My-first-end-to-end-MVC-project/","excerpt":"","text":"Note : This post is first published on Mar-2015 in my previous blog Techkindle. Moving the content to here. In my 4+ years of career, I had not got chance to work on a project from scratch. Till now whichever project I worked on, all are development but for each one of them there was a base already setup. Last November got a chance to work on a project from start to end. It was a good chance where I got the opportunity to involve in discussion with business analyst, architecting the application, and designing the database. We were three developers, no one had previously worked on ASP.NET MVC technology. But I had a little experience &amp; knowledge on the concepts. We got a tight deadline to develop the application in MVC. Anyway we were waiting for get hands on experience on MVC. So, when this opportunity given to us, we grabbed it, and we committed to deliver it on time. Totally it was around 4 months, we scratched our heads, stretched our times, daily I used to come home with some technical challenge. Used to sit whole night &amp; find some solution, then next day implementing it after going to office. Sometimes felt like was not going anywhere, we had no technical architects to guide us, we stretched ourselves but enjoyed the journey very much. At last successfully deployed the application in production on last Friday (06 Mar 2015). It was a wonderful journey through out. Happy Learning :)","categories":[{"name":"ASP.NET","slug":"ASP-NET","permalink":"http://gopigujjula.com/categories/ASP-NET/"}],"tags":[{"name":"MVC","slug":"MVC","permalink":"http://gopigujjula.com/tags/MVC/"}]},{"title":"My Favorite Technical (.NET & Other) reading list - 2","slug":"My-Favorite-Technical-Net-Other-reading-list-2","date":"2014-11-17T08:05:00.000Z","updated":"2017-02-26T11:03:20.683Z","comments":true,"path":"2014/11/My-Favorite-Technical-Net-Other-reading-list-2/","link":"","permalink":"http://gopigujjula.com/2014/11/My-Favorite-Technical-Net-Other-reading-list-2/","excerpt":"","text":"Note : This post is first published on Nov-2014 in my previous blog Techkindle. Moving the content to here. In this post, I am mentioning the list of my favorite technical articles, blogs, websites and videos, Articles: Truly understanding viewstate : This article explains everything you want to know about viewstate in ASP.NET A low-level Look at the ASP.NET Architecture : This is little outdated article, but still can learn a lot about internal workings of ASP.NET architecture. ASP.NET Application Life Cycle Overview for IIS 7.0: Very good MSDN article about whole application life cycle. ASP.NET Page Life Cycle Overview: This one is the best to understand page life cycle flow &amp; events. again this is also from MSDN. Developer Tool list for windows: In this Hanselman provides a very long list of useful tools, which make developers life easier. Blogs &amp; Websites Jon skeet websites: (C# MVP) http://yoda.arachsys.com/csharp/ http://codeblog.jonskeet.uk/ http://stackoverflow.com/users/22656/jon-skeet Scott Hanselman (Principal Program Manager - Microsoft) http://www.hanselman.com/ Eric Lippert (Previous Principal developer at Microsoft who has worked on C# compiler) http://blogs.msdn.com/b/ericlippert/ http://ericlippert.com/ http://stackoverflow.com/users/88656/eric-lippert Abhijit Jana (.NET consultant at Microsoft) http://abhijitjana.net/ http://dailydotnettips.com/ Pinal Dave http://blog.sqlauthority.com/ http://www.dotnetcurry.com/magazine/ free .NET bi-monthly magazine, which consists of articles on latest technologies in the .NET world, written by Microsoft MVP’s and industry veterans. Below websites needs no introduction http://www.w3schools.com/ http://www.codeproject.com/ http://stackoverflow.com/ Videos Tutorial videos On .NET technologies https://www.youtube.com/user/kudvenkat (Venkat is very good in explaining the complex topics, in a manner everyone can understand very easily, This channel contains videos on ASP.NET, ASP.NET MVC, WCF, Entity Framework, C#, ADO.NET and SQL Server.) NHibernate screencast serieshttp://www.summerofnhibernate.com/ (Best videos you will ever find for NHibernate.) Happy Learning :)","categories":[],"tags":[{"name":"Books","slug":"Books","permalink":"http://gopigujjula.com/tags/Books/"},{"name":"Technical Books","slug":"Technical-Books","permalink":"http://gopigujjula.com/tags/Technical-Books/"}]},{"title":"My Favorite Technical (.Net & Other) reading list - 1","slug":"My-Favorite-Technical-Net-Other-reading-list-1","date":"2014-11-16T18:01:00.000Z","updated":"2017-02-26T11:03:20.619Z","comments":true,"path":"2014/11/My-Favorite-Technical-Net-Other-reading-list-1/","link":"","permalink":"http://gopigujjula.com/2014/11/My-Favorite-Technical-Net-Other-reading-list-1/","excerpt":"","text":"Note : This post is first published on Nov-2014 in my previous blog Techkindle. Moving the content to here. It has been 4.4 years, since I have started my career as a Software Engineer (.NET developer), There are lot of articles, blogs few books I read to improve my technical skills. Here I am giving the list of my favorite books, which helped me so much in shaping my technical knowledge. This list of books are like a very good Mentor to me. Mostly related to .NET. Books:CLR via C#This book clearly explains the internal workings of CLR in .NET. We can learn the inner details of the concepts like memory management, threading, delegates, typing, assemblies, etc. Official book website:http://goo.gl/Fs822PPurchase online http://goo.gl/JIW32g C# In DepthThis book explains the C# based on each version, how the language has evolved in years &amp; how it made developers life more easier. This book is written by Jon Skeet.(very famous in StackOverflow.com website.) He burst some of our myths about C#.Official book website:http://goo.gl/FrH177Purchase online :http://goo.gl/m6Pb8o Fast ASP.NET WebsitesThis book explains much about improving the performance in the front end. I contains concepts like, caching, compression, bundling, minification, ET tags and some of the concepts specifically related to ASP.NET or ASP.NET MVC. Official book website:http://goo.gl/71OtXsPurchase online :http://goo.gl/eIp99m Learning WCF This book is little outdated. But still, none of the other books explains WCF concepts like this book. Official book website:http://goo.gl/j3swclPurchase online :http://goo.gl/ff1bZW DOM ScriptingThis book is mostly about the Document Object Model and Javascript.Official book website:http://goo.gl/CzJmvjPurchase online :http://goo.gl/KeLWSO The Art of Unit TestingThis book is about unit testing &amp; test driven developement in .NET.Official book website:http://goo.gl/P89fCmPurchase online :http://goo.gl/VHyZxt HTML &amp; CSSThis is for absolute beginners, who wants to learn about HTML and CSS.Official book website:http://goo.gl/PYBcJRPurchase online :http://goo.gl/ta7iyK HTTP Succinctly Briefly explains the HTTP protocol. It explains, what we need to know most about HTTP.Official book website: http://goo.gl/4vO4O4 NHibernate in ActionIt explains the on the very under used ORM tool,NHibernate.Official book website: http://goo.gl/HRioBIPurchase online :http://goo.gl/0FrDrf Dependency injection in .NETIt clearly Dependency injection concepts with examples in .NET platform.Official book website: http://goo.gl/c9kWrWPurchase online :http://goo.gl/wtPjAg Code the hidden language of computer hardware and softwareThis book is one of its kind. Explains how the code has been evaluated from Bailey, Morse code to current generation.Official book website: http://goo.gl/SHnLsXPurchase online : http://goo.gl/yhtH48 Producing Open Source SoftwareThis book contains all you want to know about, open source software. How the license works, how they get funds, how do they maintain the code etc.. Soft copy is freely available on the book website.Official book website: http://goo.gl/sI4FS7Purchase online: http://goo.gl/pKpocx Happy Learning :)","categories":[],"tags":[{"name":"Books","slug":"Books","permalink":"http://gopigujjula.com/tags/Books/"},{"name":"Technical Books","slug":"Technical-Books","permalink":"http://gopigujjula.com/tags/Technical-Books/"}]},{"title":"JQuery Validations","slug":"JQuery-Validations","date":"2014-09-25T19:09:00.000Z","updated":"2017-02-26T11:20:58.584Z","comments":true,"path":"2014/09/JQuery-Validations/","link":"","permalink":"http://gopigujjula.com/2014/09/JQuery-Validations/","excerpt":"","text":"Note : This post is first published on Sep-2014 in my previous blog Techkindle. Moving the content to here. Code Snippet for validating the textbox, dropdownlist, and radiobuttonlist in ASP.NET page using Jquery. To check Textbox value: txtName is the textbox id: 123if ($.trim($(“#txtName”).val()).length == 0) &#123; //Enter a name&#125; To check Whether entered value is number or not: $.isNumeric(value) method can be used to check for number 1234var age = $.trim($(“#txtAge”).val());if ($.isNumeric(age)) &#123; //Entered number is Numeric&#125; To check whether any radio button is checked: rdbGender is the Radiobuttonlist id: 123if ($(“#rdbGender input:checked”).length == 0) &#123; //Gender is not selected&#125; To check whether any dropdownlist value is checked: ddlQualification is the Dropdownlist id: 123if ($(“#ddlQualification option:selected”).val() == 0) &#123;//Qualification is not selected&#125; Total Source Code Output Screen Happy Coding :)","categories":[],"tags":[{"name":"JQuery","slug":"JQuery","permalink":"http://gopigujjula.com/tags/JQuery/"}]},{"title":"ASP.NET Page life cycle","slug":"ASP-NET-Page-life-cycle","date":"2014-03-29T10:44:00.000Z","updated":"2016-11-05T11:54:59.105Z","comments":true,"path":"2014/03/ASP-NET-Page-life-cycle/","link":"","permalink":"http://gopigujjula.com/2014/03/ASP-NET-Page-life-cycle/","excerpt":"","text":"Note : This post is first published on Mar-2014 in my previous blog Techkindle. Moving the content to here. This is some of the notes I have collected when digging more details on the page life cycle. The below points are fetched up from all over the net. Page Life Cycle in ASP.NET Page_PreInit This is the first event raised in the ASP.NET page life cycle. IsPostBack property would have bee already set by this event, so we can determine whether this is the first request or not. Create or re-create dynamic controls. Set a master page dynamically. Set the Theme property dynamically. Read or set profile property values. We can not access any ViewState and PostBack data, because that data would not be loaded by this time. Master page can only be set in this event or before to this event. if we try to set it in any other event, exception will be thrown. There are two ways to add dynamic controls in the page,_ If there is no master page associated with the current page, then we can create dynamic controls in this event. If there is a master page associated with the current page, then we need to add controls in the Init event. Page_Init This event is recursive, The Init event of individual controls occurs before the Init event of the page. Create or re-create dynamic controls. By using this event we can read or initialize control properties. We can set the Page.ViewStateUserKey value only in this event,if we try to set it in any other event, exception will be thrown._ We can not access any ViewState and PostBack data, because that data would not be loaded by this time. Page_InitComplete This is the last event in the initialization. Before this event TrackViewState() method would be called. So from here on wards, any changes to viewstate data will be persisted to next postbacks. We can not access any ViewState and PostBack data in this event, because that data would not be loaded by this time. We can use this event to change any data, that should be persisted in the next postback. Page_PreLoad This is the first event will be called after loading the ViewState and the Postback data by two methods, LoadViewState and LoadPostData respectively. The purpose of the Page.PreLoad event is to provide a hook for control authors. The behavior of the load phase of the page lifecycle, is that &nbsp;the Load event is raised on the page before it is raised on all its child controls. As a control author, you might want to perform some action after viewstate is loaded (so Init is too early), but before Page_Load is called (so Load is too late). How you do that is to add an event handler to Page.PreLoad. Page_Load This event is recursive, The Load event of the page occurs before the Load event of the controls. We can use this event to set properties in controls and to establish database connections. Control events Use these events to handle specific control events, such as a Button control’s Click event or a TextBox control’s TextChanged event. Page_LoadComplete Use this event for tasks that require that all other controls on the page be loaded. There may be certain situations where we need to do some processing after control event, in that case Load event will be too early, so we can use the LoadComplete event for this king of processing.When you hook up several methods to the Load event you don’t know the order they will get called. So you have the PreLoad, Load and LoadComplete events to have some more control as to in what order your code gets called. The use of this might not always be clear when working only with your page class. When working with controls however, with the need to have some code running at Load time, you might want to make it run right before or right after what would normally happen in the Load event. Then you can use the PreLoad and LoadComplete methods. Page_PreRender This event is recursive, The PreRender event of the page occurs before the PreRender event of the controls. Raised after the Page object has created all controls that are required in order to render the page, including child controls of composite controls. Use the event to make final changes to the contents of the page or its controls before the rendering stage begins. Page_PreRenderComplete Raised after each data bound control whose DataSourceID property is set calls its DataBind method. This is the last event raised before the page’s view state is saved. SaveStateComplete Raised after view state and control state have been saved for the page and for all controls. Any changes to the page or controls at this point affect rendering, but the changes will not be retrieved on the next postback. Render This is not an event; instead, at this stage of processing, the Page object calls this method on each control. All ASP.NET Web server controls have a Render method that writes out the control’s markup to send to the browser. Unload This event is recursive, The Unload event of individual controls occurs before the Unload event of the page. In controls, use this event to do final cleanup for specific controls, such as closing control-specific database connections.For the page itself, use this event to do final cleanup work, such as closing open files and database connections, or finishing up logging or other request-specific tasks. During the unload stage, the page and its controls have been rendered, so you cannot make further changes to the response stream. If you attempt to call a method such as the Response.Write method, the page will throw an exception.","categories":[{"name":"ASP.NET","slug":"ASP-NET","permalink":"http://gopigujjula.com/categories/ASP-NET/"}],"tags":[{"name":"ASP.NET","slug":"ASP-NET","permalink":"http://gopigujjula.com/tags/ASP-NET/"}]},{"title":"typeof","slug":"typeof","date":"2014-03-23T11:38:00.000Z","updated":"2017-02-26T11:22:21.895Z","comments":true,"path":"2014/03/typeof/","link":"","permalink":"http://gopigujjula.com/2014/03/typeof/","excerpt":"","text":"Note : This post is first published on Mar-2014 in my previous blog Techkindle. Moving the content to here. typeof is an operator, which cannot be overloaded.Used to obtain the System.Type object for a type.This operator uses reflection to access the metadata descriptions of the types.There is only one System.Type object for any given type. This means that for a type T, typeof(T)==typeof(T) is always true. This type cannot be dynamic. Synatx: typeof(type) typeof(unbound-type-name) typeof(void) It returns the System.Type object for the specified type. [Note: An Unbound-type-name is very similar to a type name except that an unbound-type-name contains generic-dimension-specifiers wherea type-name contains type-argument-lists.] Examples:1234typeof(int);//System.Int32typeof(List&lt;int&gt;);//System.Collections,Generic.List&apos;1[System.Int32]typefo(Dictionary&lt;,&gt;);//System.Collections,Generic.Dictionary&apos;2[TKey,TValue]typeof(void);//System.Void The result of typeof(void) is the System.Type object that represents the absence of a type. This special type object is useful in class libraries that allow reflection onto methods in the language, where those methods wish to have a way to represent the return type of any method, including void methods, with an instance of System.Type. Test:123Employee objEmployee = new Employee();System.Type t = typeof(objEmployee); //throws error, because typeof only works on types, not on variables.System.Type t = typeof(Employee) ; //it is fine. Happy Coding :)","categories":[{"name":"C#","slug":"C","permalink":"http://gopigujjula.com/categories/C/"}],"tags":[{"name":"C#","slug":"C","permalink":"http://gopigujjula.com/tags/C/"}]},{"title":"Converting Csv to DataTable","slug":"Converting-Csv-to-DataTable","date":"2013-04-25T10:11:00.000Z","updated":"2017-02-26T10:58:20.980Z","comments":true,"path":"2013/04/Converting-Csv-to-DataTable/","link":"","permalink":"http://gopigujjula.com/2013/04/Converting-Csv-to-DataTable/","excerpt":"","text":"Note :This post is first published on Apr-2013 in my previous blog Techkindle. Moving the content to here. Steps: First, by using the File class static method ReadAllLines(path), read all the lines from the csv file&nbsp; to the string array. In the resulting array, first element contains the column names. using the first line, we should create the Data table columns. Other than the first element, all other elements contains the row’s data. Using the same we can create the data table rows. Output Happy Coding :)","categories":[{"name":"C#","slug":"C","permalink":"http://gopigujjula.com/categories/C/"}],"tags":[{"name":"C#","slug":"C","permalink":"http://gopigujjula.com/tags/C/"}]},{"title":"Creating Csv file from DataTable in C#","slug":"Creating-Csv-file-from-DataTable-in-C","date":"2013-04-25T09:20:00.000Z","updated":"2017-02-26T10:58:33.718Z","comments":true,"path":"2013/04/Creating-Csv-file-from-DataTable-in-C/","link":"","permalink":"http://gopigujjula.com/2013/04/Creating-Csv-file-from-DataTable-in-C/","excerpt":"","text":"Note :This post is first published on Apr-2013 in my previous blog Techkindle. Moving the content to here. Steps: Create a DataTable Schema. Fill the created table with some sample data. Create a StringBuilder, by appending all the data, (using comma delimiter) Create one new line with data table columns. Create one line for each data table row. Save the StringBuilder to Csv file, using FileStream. Happy Coding :)","categories":[{"name":"C#","slug":"C","permalink":"http://gopigujjula.com/categories/C/"}],"tags":[{"name":"C#","slug":"C","permalink":"http://gopigujjula.com/tags/C/"}]},{"title":"Excel Load To DataTable using OleDb in C#","slug":"Excel-Load-To-DataTable-using-OleDb-in-C","date":"2013-04-19T11:09:00.000Z","updated":"2017-02-26T11:20:58.436Z","comments":true,"path":"2013/04/Excel-Load-To-DataTable-using-OleDb-in-C/","link":"","permalink":"http://gopigujjula.com/2013/04/Excel-Load-To-DataTable-using-OleDb-in-C/","excerpt":"","text":"Note :This post is first published on Apr-2013 in my previous blog Techkindle. Moving the content to here. Here we will try to load Excel sheet data into the datatable using Jet engine.First, We need to Download and install the AccessDatabaseEngine exe from the microsoft website. Complete Source Code Output Happy Coding :)","categories":[{"name":"C#","slug":"C","permalink":"http://gopigujjula.com/categories/C/"}],"tags":[{"name":"C#","slug":"C","permalink":"http://gopigujjula.com/tags/C/"}]},{"title":"Program to Add two 50 digit numbers in C#","slug":"Program-to-Add-two-50-digit-numbers-in-C","date":"2013-04-18T12:26:00.000Z","updated":"2017-02-26T11:20:58.678Z","comments":true,"path":"2013/04/Program-to-Add-two-50-digit-numbers-in-C/","link":"","permalink":"http://gopigujjula.com/2013/04/Program-to-Add-two-50-digit-numbers-in-C/","excerpt":"","text":"Note :This post is first published on Apr-2013 in my previous blog Techkindle. Moving the content to here. Below code, without using BigInteger structure. Output Happy coding :)","categories":[{"name":"C#","slug":"C","permalink":"http://gopigujjula.com/categories/C/"}],"tags":[{"name":"C#","slug":"C","permalink":"http://gopigujjula.com/tags/C/"}]},{"title":"Split the List of objects into Batches using LINQ","slug":"Split-the-List-of-objects-into-Batches-using-LINQ","date":"2013-03-15T13:10:00.000Z","updated":"2017-02-26T11:22:21.959Z","comments":true,"path":"2013/03/Split-the-List-of-objects-into-Batches-using-LINQ/","link":"","permalink":"http://gopigujjula.com/2013/03/Split-the-List-of-objects-into-Batches-using-LINQ/","excerpt":"","text":"Note :This post is first published on Mar-2013 in my previous blog Techkindle. Moving the content to here. There may be certain situations, When we have a number of objects in the list, but we need to split the objects into batches by batch size. To achieve that we can use Skip and Take static methods in LINQ, Skip : Bypasses a specified number of elements in a sequence and then returns the remaining elements. Take : Returns a specified number of contiguous elements from the start of a sequence. Using both these static methods, we can split the list into multiple lists based on the batch size. While writing the source code, my main intention is to just show how to split the list into batch sizes. So didn’t take the validations, and other things into consideration. First of all creating a Student Class. Which is a template to create the Student objects. (We can use anonymous types also). Then writing a method to create a list of objects for student class. I have just given some random data, and creating some 23 objects. Then writing a method to split the passed list of objects into batches, based on the passed batch size. At last calling all the methods from the Main method. Here I am giving the full source code. Output: Happy Coding :)","categories":[{"name":"C#","slug":"C","permalink":"http://gopigujjula.com/categories/C/"}],"tags":[{"name":"C#","slug":"C","permalink":"http://gopigujjula.com/tags/C/"},{"name":"LINQ","slug":"LINQ","permalink":"http://gopigujjula.com/tags/LINQ/"}]},{"title":"Print N numbers without using Loops","slug":"Print-N-numbers-without-using-Loops","date":"2012-07-30T06:50:00.000Z","updated":"2017-02-26T11:20:58.659Z","comments":true,"path":"2012/07/Print-N-numbers-without-using-Loops/","link":"","permalink":"http://gopigujjula.com/2012/07/Print-N-numbers-without-using-Loops/","excerpt":"","text":"Note :This post is first published on Mar-2013 in my previous blog Techkindle. Moving the content to here. In some interviews we may get a question like print certain numbers without using any loops.There are many approaches to accomplish this task. Here i am giving two of the approaches With recursion With goto statement With Recursion123456789void PrintWithRecursion(int fromNumber, int toNumber)&#123; if (fromNumber &lt;= toNumber) &#123; Console.Write(fromNumber + &quot; &quot;); fromNumber++; PrintWithRecursion(fromNumber, toNumber); &#125;&#125; With goto statement1234567891011void PrintWithGoto(int fromNumber, int toNumber)&#123; Repeat: if (fromNumber &lt;= toNumber) &#123; Console.Write(fromNumber + &quot; &quot;); fromNumber++; goto Repeat; &#125; Console.Read();&#125; Complete Source code:output: Happy Coding :)","categories":[{"name":"C#","slug":"C","permalink":"http://gopigujjula.com/categories/C/"}],"tags":[{"name":"C#","slug":"C","permalink":"http://gopigujjula.com/tags/C/"}]},{"title":"Unlocker - System Utility","slug":"Unlocker-System-Utility","date":"2012-06-14T09:41:00.000Z","updated":"2017-02-26T11:22:21.839Z","comments":true,"path":"2012/06/Unlocker-System-Utility/","link":"","permalink":"http://gopigujjula.com/2012/06/Unlocker-System-Utility/","excerpt":"","text":"Note :This post is first published on June-2012 in my previous blog Techkindle. Moving the content to here. In PC, When we try to access a file or folder, some times we may get few annoying messages like below, Cannot delete file: Access is denied.There has been a sharing violation.The source or destination file may be in use.The file is in use by another program or user.Make sure the disk is not full or write-protected and that the file is not currently in use. So, what is the main problem here, why we are unable to access these files or folders? Answer is these files/folders may be Locked. To resolve these kind of issues, we have one handy utility Unlocker, using which we can identify whether a file/folder has been locked or not, and can unlock the them. Unlocker is an explorer extension. Once we finish with downloading and installation of Unlocker, all we need to is just right click on any of the file or folder (which we are unable to access) and select the unlocker option. Then if the folder/file is locked, a window listing of lockers will appear. Then we can take an appropriate action on that.","categories":[],"tags":[{"name":"Tools","slug":"Tools","permalink":"http://gopigujjula.com/tags/Tools/"}]},{"title":"File copying using FTP","slug":"File-copying-using-FTP","date":"2011-11-10T09:36:00.000Z","updated":"2017-02-26T11:03:20.459Z","comments":true,"path":"2011/11/File-copying-using-FTP/","link":"","permalink":"http://gopigujjula.com/2011/11/File-copying-using-FTP/","excerpt":"","text":"Note: This post is first published on Nov-2011 in my previous blog Techkindle. Moving the content to here. Normal FTP file copying process using built in classes provided System.Net NameSpace.The code is as follows, do not forget to add System.Net namespace. Happy Coding :)","categories":[{"name":"C#","slug":"C","permalink":"http://gopigujjula.com/categories/C/"}],"tags":[{"name":"C#","slug":"C","permalink":"http://gopigujjula.com/tags/C/"}]},{"title":"Swapping two integers","slug":"Swapping-two-integers","date":"2011-11-09T12:50:00.000Z","updated":"2017-02-26T11:22:21.926Z","comments":true,"path":"2011/11/Swapping-two-integers/","link":"","permalink":"http://gopigujjula.com/2011/11/Swapping-two-integers/","excerpt":"","text":"Note :This post is first published on Nov-2011 in my previous blog Techkindle. Moving the content to here. Swapping Two Integers using different methods. Using Temporary variable Using Arithmetic Operators Using EX-OR operator Here is the complete source code. Output it as shown Below: Happy Coding :)","categories":[{"name":"C#","slug":"C","permalink":"http://gopigujjula.com/categories/C/"}],"tags":[{"name":"C#","slug":"C","permalink":"http://gopigujjula.com/tags/C/"}]},{"title":"DataRowState","slug":"DataRowState","date":"2011-11-08T12:14:00.000Z","updated":"2017-02-26T10:58:51.539Z","comments":true,"path":"2011/11/DataRowState/","link":"","permalink":"http://gopigujjula.com/2011/11/DataRowState/","excerpt":"","text":"Note : This post is first published on Nov-2011 in my previous blog Techkindle. Moving the content to here. DataRowState : Its a state corresponding to each row in DataTable. Consider the following scenario, we have a set of records in DB and from the User Interface we need to provide the facility for user to update any existing records or to add any new records. But, this set of changed records need to send to the DB all at once (i.e for example on a Button Click event), Till that time we need to retain all the records at our page itself. and user also have an option to cancel these changes.So, while sending all the records to DB at once, we need to find a way to check which row is to be inserted, and which row need to be updated in DB, one option is to maintain one more column in the table as flag, but its very difficult to maintain these flags. another option is to take the advantage of the DataRowState (if we assume records will be maintained in the DataTable). Each row will be having a State (like Added, Unchanged, Modified etc..), using this States we can easily find out which row should be saved and which row should be updated.DataRowState is very much useful in this kind of scenarios. First we will look at the different states present in DataRowState, Added The row has been added to a DataRowCollection, and AcceptChanges has not been called. Modified The row has been modified and AcceptChanges has not been called. UnChanged The row has not changed since AcceptChanges was last called. Detached The row has been created but is not part of any DataRowCollection. A DataRow is in this state immediately after it has been created and before it is added to a collection, or if it has been removed from a collection. Deleted The row was deleted using the Delete method of the DataRow. The below is the example with the all states. The output will be as follows:In the above output we can see that , at last the changes are canceled, but still one of the row is not exist.this is because it has got removed(not deleted).we cannot get the records back once we use Remove. but if we use Delete, still we can get our records back. Happy Coding :)","categories":[{"name":"C#","slug":"C","permalink":"http://gopigujjula.com/categories/C/"}],"tags":[{"name":"C#","slug":"C","permalink":"http://gopigujjula.com/tags/C/"}]},{"title":"NUnit Sample Application","slug":"NUnit-Sample-Application","date":"2011-06-24T13:05:00.000Z","updated":"2017-02-26T11:20:58.637Z","comments":true,"path":"2011/06/NUnit-Sample-Application/","link":"","permalink":"http://gopigujjula.com/2011/06/NUnit-Sample-Application/","excerpt":"","text":"Note :This post is first published on June-2011 in my previous blog Techkindle. Moving the content to here. Steps to use NUnit First download current version of NUnit here. Install it in your machine. Create one sample Class Library in visual studio, and name it Calculations. Now, we just write some small calculation methods like Addition and Subtraction etc.. Code(.cs file) will be like this123456789101112131415161718192021222324using System;using System.Collections.Generic;using System.Linq;using System.Text;namespace Calculations&#123; public class Calc &#123; private int sum; private int subtr; public int Addition(int a, int b) &#123; sum = a + b; return sum; &#125; public int Subtraction(int a, int b) &#123; subtr = a - b; return subtr; &#125; &#125;&#125; Then Create another class library, where we can write the test cases for the above methods. Let us assume it as a NunitSampleTest.cs For this Class library we need to add nunit reference.If you have installed NUnit in C drive, You can find this reference from the below pathC:\\Program Files\\NUnit 2.5.10\\bin\\net-2.0\\framework\\nunit.framework.dll Then we need to add Calculations reference. Now we need to write the test cases as below 12345678910111213141516171819202122232425262728using System;using System.Collections.Generic;using System.Linq;using System.Text;using Calculations;using NUnit.Framework;namespace NUnitSampleTest&#123; [TestFixture] public class NUnitTestClass &#123; [Test] public void AdditionTest() &#123; Calc newobj = new Calc(); int sum = newobj.Addition(20, 10); Assert.AreEqual(30, sum); &#125; [Test] public void SubtractionTest() &#123; Calc newobj = new Calc(); int subtr = newobj.Subtraction(20, 10); Assert.AreEqual(10, subtr); &#125; &#125;&#125; [Note: In the above code we can find out two new attributes, [ TestFixture ] and [ Test ] and one class Assert.The TestFixture attribute is specified for the classes, When we attach this attribute to a class, the Test Runner application will scan it for test methods.The only restrictions on classes that use the TestFixture attribute are that they must have a public default constructor (or no constructor which is the same thing). The Test attribute marks a specific method inside a class that has already been marked as a TestFixture, as a test method. Assertions are central to unit testing. The Assert claas provides a variety of static methods, using which we can test the result with the actual expected value.] this all completes the coding part Now to test this application, we need to open NUnit UI, this we can find out at the below path(C:\\Program Files\\NUnit 2.5.10\\bin\\net-2.0)orGoto start-&gt;All Programs -&gt;NUnit 2.5.10 The window will be like as shown below Now Goto File-&gt;open Project , then Go to the path and click on the NunitSampleTest.Dll It will open the methods as shown below.. so right click on the individual methods or whole class and click on Run If all the test cases are passed successfully, then we can see the green color Line as shown below But if get Red color line, then it means TestCase is failed. The above figure indicates that we have an issue in Subtraction Method.. Note: To Make things simpler we have hard coded the values in the TestCase methods.Rather than hard coding the values, we can create one separate class with values and can pass them to respective methods. Happy Coding :)","categories":[],"tags":[{"name":"Tools","slug":"Tools","permalink":"http://gopigujjula.com/tags/Tools/"}]},{"title":"Logging Tool (Log4net)","slug":"Logging-Tool-Log4net","date":"2010-12-31T12:11:00.000Z","updated":"2017-02-26T11:20:58.616Z","comments":true,"path":"2010/12/Logging-Tool-Log4net/","link":"","permalink":"http://gopigujjula.com/2010/12/Logging-Tool-Log4net/","excerpt":"","text":"Note : This post is first published on Dec-2010 in my previous blog Techkindle. Moving the content to here. LOGGINGIt is an important component of the development cycle. It is the process of recording information with automated program. It is used to understand the activity of the application &amp; to diagnose problems. Features It provides precise context about the execution of the application. Once inserted into the code, the generation of logging output requires no human intervention. Log output can be saved in persistent medium to be studied at a later time. Log4net Its an open source library that allows .NET applications to output log statements to a variety of output targets such as to a file,the console, the database or even e.mail.It allows the developer to control which log statements are output with arbitrary granularity. It is fully configurable at run time using external configuration files. Features: log4net is optimized for speed. log4net is based on a named logger hierarchy. log4net is fail-stop but not reliable. log4net is thread-safe. log4net is not restricted to a predefined set of facilities. Logging behavior can be set at run time using a configuration file. Configuration files are in XML format. log4net is designed to handle exceptions from the start. log4net categorizes logging into levels: DEBUG, INFO, WARN, ERROR and FATAL. The format of the log output can be easily changed by implementing a new layout class. The target of the log output as well as the writing strategy can be altered by writing a new appender class. log4net supports multiple output appenders per logger. Log4net can be downloaded from here. Log4net Download Log4net is from the The Apache Software FoundationNote:It can slow down the application. Other Logging frameworks are log4j for Java log4cxx for C++ log4php for PHP Happy Learning :)","categories":[],"tags":[{"name":"Tools","slug":"Tools","permalink":"http://gopigujjula.com/tags/Tools/"}]},{"title":"XML Creation","slug":"Xml-Creation","date":"2010-12-31T05:30:00.000Z","updated":"2017-02-26T11:06:02.187Z","comments":true,"path":"2010/12/Xml-Creation/","link":"","permalink":"http://gopigujjula.com/2010/12/Xml-Creation/","excerpt":"","text":"Note : This post is first published on Dec-2010 in my previous blog Techkindle. Moving the content to here. Creation of XML file is very much easy with the existing class library in the .NET framework with C#. Although we can create many complex XML files, here I have presented a simple application which is easy to understand, it create &amp; stores the XML file in text file. It retrieves the XML file &amp; displays the data. Output Created XML File: Retrieved XML data: Happy Coding :)","categories":[{"name":"C#","slug":"C","permalink":"http://gopigujjula.com/categories/C/"}],"tags":[{"name":"XML","slug":"XML","permalink":"http://gopigujjula.com/tags/XML/"}]},{"title":"FIREBUG (Developer Tool for Firefox)","slug":"Firebug-Development-Tool","date":"2010-12-30T05:30:00.000Z","updated":"2017-02-26T11:20:58.481Z","comments":true,"path":"2010/12/Firebug-Development-Tool/","link":"","permalink":"http://gopigujjula.com/2010/12/Firebug-Development-Tool/","excerpt":"","text":"Note : This post is first published on Dec-2010 in my previous blog Techkindle. Moving the content to here. FIREBUG Firebug is an open source extension for the Mozilla Firefox Browser, which provides tools to monitor, edit, and debug any website’s CSS, HTML, DOM, and JavaScript. It also has a JavaScript console for logging errors and watching values, as well as a “Net” feature which monitors the amount of time in milliseconds it takes to execute scripts and load images on the page. CSS, HTML : In live we can edit the CSS &amp; HTML of any web page &amp; can view the result. JavaScript : using firebug we can debug the JavaScript code by putting breakpoints &amp; can also log the errors. Network Monitor : This Feature lets you monitor how much time is spent when loading a web page. Use the Net tab to see the bar that shows when a file started and stopped loading relative to all other files. Network Monitor breaks up the traffic on a file-by-file basis so we can see how much time is spent loading image, JavaScript, HTML, and so forth. Steps Download Firebug from http://getfirebug.com/downloads. Install &amp; restart the browser. By going to any web page press f12 then you can see the window at the bottom of the page. Note: The edited HTML or CSS or JavaScript wont effect the existing code. There is also a Firebug Lite version for Internet Explorer, Opera and Safari. Happy Learning :)","categories":[],"tags":[{"name":"Tools","slug":"Tools","permalink":"http://gopigujjula.com/tags/Tools/"}]},{"title":"Color Cop","slug":"ColorCrop","date":"2010-12-15T04:55:00.000Z","updated":"2017-02-26T11:08:21.069Z","comments":true,"path":"2010/12/ColorCrop/","link":"","permalink":"http://gopigujjula.com/2010/12/ColorCrop/","excerpt":"","text":"Note :This post is first published on Dec-2010 in my previous blog Techkindle. Moving the content to here. This is my first post in this blog. Pretty much excited. Like all techies, I too spend most of the time with computers, so just want to share few things (related to technology), which I learn or come across in my daily technical life. Now comes to our topic, Web designing is very much important for each websites. In designing the web pages color plays a vital role. Four ways in which we can specify the colors are: Using color name (eg: black, white, red, yellow etc..) Using Hex Code of a color (eg: ##000000, #ffffff etc..) Using RGB pecentage (eg: rgb(0%, 10%, 60%)) Using RGB decimal value (eg: rgb(255,0,0) In all the above options, Hexcode is very much used because of its coverage of wide range colors.. But its always difficult to know all the combinations of colors, and also sometimes if we come across any different color combination and we want to use the same in our page.Then the problem is how to identify the name or hexcode of the color.The better way to identify hexcode or RGB value of any particular color is to use ColorCop (a free multi-purpose color picker for windows) Using the ColorCop, we can place the cursor on any object, then it gives the the hexcode &amp; RGB value of that particular object’s color. For demo please click on this link: ColorCop demo","categories":[],"tags":[{"name":"Tools","slug":"Tools","permalink":"http://gopigujjula.com/tags/Tools/"}]}]}